//KERY9026 JOB (KER),'KER06',CLASS=S,MSGCLASS=X,MSGLEVEL=(1,1)
//S1 EXEC YSRCCAT,MBR=K11B9026
//C.SYSUT1 DD *
      *===============================================================*
      *=            （（（　위험보험료　　）））　　　　           =*
      *===============================================================*
      *****************************************************************
      *      노후　BOJ  (  '94.  7.  20  )                            *
      *****************************************************************
       01  RISK-NOHOO.
      *---------(  85   GANEE      RISK MAN  )-----------------------*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0051200548005830061900019'.
         02 FILLER     PIC  X(25)  VALUE  '0052900572006160066000020'.
20       02 FILLER     PIC  X(25)  VALUE  '0053800586006340068200021'.
         02 FILLER     PIC  X(25)  VALUE  '0054500596006460069700022'.
         02 FILLER     PIC  X(25)  VALUE  '0054200594006450069700022'.
         02 FILLER     PIC  X(25)  VALUE  '0054000590006400068900022'.
         02 FILLER     PIC  X(25)  VALUE  '0053400581006270067400021'.
25       02 FILLER     PIC  X(25)  VALUE  '0052400565006060064800020'.
         02 FILLER     PIC  X(25)  VALUE  '0051600553005900062700019'.
         02 FILLER     PIC  X(25)  VALUE  '0051000544005780061100018'.
         02 FILLER     PIC  X(25)  VALUE  '0050800541005730060600018'.
         02 FILLER     PIC  X(25)  VALUE  '0050700541005750060900018'.
30       02 FILLER     PIC  X(25)  VALUE  '0051600555005930063100019'.
         02 FILLER     PIC  X(25)  VALUE  '0052600568006110065300020'.
         02 FILLER     PIC  X(25)  VALUE  '0053700585006320068000021'.
         02 FILLER     PIC  X(25)  VALUE  '0055000603006570071100023'.
         02 FILLER     PIC  X(25)  VALUE  '0056400625006860074700024'.
35       02 FILLER     PIC  X(25)  VALUE  '0057700645007140078300026'.
         02 FILLER     PIC  X(25)  VALUE  '0059600674007520083000028'.
         02 FILLER     PIC  X(25)  VALUE  '0062200712008020089200031'.
         02 FILLER     PIC  X(25)  VALUE  '0065000754008580096200034'.
         02 FILLER     PIC  X(25)  VALUE  '0068000800009210104100038'.
40       02 FILLER     PIC  X(25)  VALUE  '0071900858009970113600042'.
         02 FILLER     PIC  X(25)  VALUE  '0076400925010850124600048'.
         02 FILLER     PIC  X(25)  VALUE  '0080100982011630134400052'.
         02 FILLER     PIC  X(25)  VALUE  '0084601048012510145300057'.
         02 FILLER     PIC  X(25)  VALUE  '0089501121013470157300063'.
45       02 FILLER     PIC  X(25)  VALUE  '0094601199014510170300069'.
         02 FILLER     PIC  X(25)  VALUE  '0100601287015670184800075'.
         02 FILLER     PIC  X(25)  VALUE  '0106801380016930200600083'.
         02 FILLER     PIC  X(25)  VALUE  '0113501482018290217600091'.
         02 FILLER     PIC  X(25)  VALUE  '0121501600019850237000099'.
50       02 FILLER     PIC  X(25)  VALUE  '0129801725021520258000109'.
         02 FILLER     PIC  X(25)  VALUE  '0139001863023370281000120'.
         02 FILLER     PIC  X(25)  VALUE  '0149102015025400306400131'.
         02 FILLER     PIC  X(25)  VALUE  '0160302184027640334500144'.
         02 FILLER     PIC  X(25)  VALUE  '0172702369030110365300158'.
55       02 FILLER     PIC  X(25)  VALUE  '0186302572032810399000174'.
         02 FILLER     PIC  X(25)  VALUE  '0201302797035800436400191'.
         02 FILLER     PIC  X(25)  VALUE  '0217403039039040477000209'.
         02 FILLER     PIC  X(25)  VALUE  '0235603312042670522200230'.
         02 FILLER     PIC  X(25)  VALUE  '0255203606046600571400252'.
60       02 FILLER     PIC  X(25)  VALUE  '0277303936050990626100277'.
         02 FILLER     PIC  X(25)  VALUE  '0301204295055780686100304'.
         02 FILLER     PIC  X(25)  VALUE  '0327404688061010751500334'.
         02 FILLER     PIC  X(25)  VALUE  '0356405123066820824000366'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000402'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000441'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000484'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000531'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000582'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000638'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *---------(  85   GANEE      RISK WOMAN  )---------------------*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0022600231002360024100006'.
         02 FILLER     PIC  X(25)  VALUE  '0023200240002480025600007'.
20       02 FILLER     PIC  X(25)  VALUE  '0023800249002590027000008'.
         02 FILLER     PIC  X(25)  VALUE  '0024300256002700028300008'.
         02 FILLER     PIC  X(25)  VALUE  '0024600261002760029100009'.
         02 FILLER     PIC  X(25)  VALUE  '0024800264002800029600009'.
         02 FILLER     PIC  X(25)  VALUE  '0024800264002800029600009'.
25       02 FILLER     PIC  X(25)  VALUE  '0024700262002770029200008'.
         02 FILLER     PIC  X(25)  VALUE  '0024700262002770029200009'.
         02 FILLER     PIC  X(25)  VALUE  '0024900266002820029800009'.
         02 FILLER     PIC  X(25)  VALUE  '0025400272002900030900009'.
         02 FILLER     PIC  X(25)  VALUE  '0026000282003040032600010'.
30       02 FILLER     PIC  X(25)  VALUE  '0026800294003190034500011'.
         02 FILLER     PIC  X(25)  VALUE  '0027500304003330036200012'.
         02 FILLER     PIC  X(25)  VALUE  '0028200314003470037900013'.
         02 FILLER     PIC  X(25)  VALUE  '0028600321003550039000013'.
         02 FILLER     PIC  X(25)  VALUE  '0029100327003640040000014'.
35       02 FILLER     PIC  X(25)  VALUE  '0029400333003710040900014'.
         02 FILLER     PIC  X(25)  VALUE  '0029900339003800042000014'.
         02 FILLER     PIC  X(25)  VALUE  '0030500348003920043500015'.
         02 FILLER     PIC  X(25)  VALUE  '0031000359004070045500016'.
         02 FILLER     PIC  X(25)  VALUE  '0032200375004290048300017'.
40       02 FILLER     PIC  X(25)  VALUE  '0033400394004540051300019'.
         02 FILLER     PIC  X(25)  VALUE  '0035000417004850055200021'.
         02 FILLER     PIC  X(25)  VALUE  '0036600442005180059400023'.
         02 FILLER     PIC  X(25)  VALUE  '0038400469005530063700025'.
         02 FILLER     PIC  X(25)  VALUE  '0040500500005950069000027'.
45       02 FILLER     PIC  X(25)  VALUE  '0043000537006450075200030'.
         02 FILLER     PIC  X(25)  VALUE  '0045900580007010082200033'.
         02 FILLER     PIC  X(25)  VALUE  '0049300631007690090700037'.
         02 FILLER     PIC  X(25)  VALUE  '0053100687008440100100041'.
         02 FILLER     PIC  X(25)  VALUE  '0057400753009310110900046'.
50       02 FILLER     PIC  X(25)  VALUE  '0062100823010240122600052'.
         02 FILLER     PIC  X(25)  VALUE  '0066600891011160134200057'.
         02 FILLER     PIC  X(25)  VALUE  '0071500965012140146400063'.
         02 FILLER     PIC  X(25)  VALUE  '0076501040013140158900069'.
         02 FILLER     PIC  X(25)  VALUE  '0081701117014160171600074'.
55       02 FILLER     PIC  X(25)  VALUE  '0087301201015280185600081'.
         02 FILLER     PIC  X(25)  VALUE  '0094501310016740203900089'.
         02 FILLER     PIC  X(25)  VALUE  '0102601432018370224200099'.
         02 FILLER     PIC  X(25)  VALUE  '0111901570020210247200109'.
         02 FILLER     PIC  X(25)  VALUE  '0122201723022240272500121'.
60       02 FILLER     PIC  X(25)  VALUE  '0133001888024460300300134'.
         02 FILLER     PIC  X(25)  VALUE  '0145702075026940331300148'.
         02 FILLER     PIC  X(25)  VALUE  '0159502283029700365600164'.
         02 FILLER     PIC  X(25)  VALUE  '0174402507032700403300181'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000200'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000222'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000245'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000271'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000300'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000332'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *-------------------(   1 HOI   MAN   RISK  LYO )--------------*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0043800451004630047500012'.
         02 FILLER     PIC  X(25)  VALUE  '0045000467004850050200014'.
20       02 FILLER     PIC  X(25)  VALUE  '0046000483005050052800015'.
         02 FILLER     PIC  X(25)  VALUE  '0046900496005230054900016'.
         02 FILLER     PIC  X(25)  VALUE  '0047600507005370056700017'.
         02 FILLER     PIC  X(25)  VALUE  '0048000512005440057600017'.
         02 FILLER     PIC  X(25)  VALUE  '0048000514005470058100017'.
25       02 FILLER     PIC  X(25)  VALUE  '0048300517005510058600018'.
         02 FILLER     PIC  X(25)  VALUE  '0048600522005570059300018'.
         02 FILLER     PIC  X(25)  VALUE  '0048800525005620059800018'.
         02 FILLER     PIC  X(25)  VALUE  '0049200531005690060800018'.
         02 FILLER     PIC  X(25)  VALUE  '0049700537005770061700019'.
30       02 FILLER     PIC  X(25)  VALUE  '0050300546005900063300020'.
         02 FILLER     PIC  X(25)  VALUE  '0050600552005980064400020'.
         02 FILLER     PIC  X(25)  VALUE  '0051400564006150066500021'.
         02 FILLER     PIC  X(25)  VALUE  '0052400578006330068700022'.
         02 FILLER     PIC  X(25)  VALUE  '0053600596006560071600024'.
35       02 FILLER     PIC  X(25)  VALUE  '0055000617006830075000025'.
         02 FILLER     PIC  X(25)  VALUE  '0056400639007150079000027'.
         02 FILLER     PIC  X(25)  VALUE  '0058600672007580084400030'.
         02 FILLER     PIC  X(25)  VALUE  '0061300711008100090900033'.
         02 FILLER     PIC  X(25)  VALUE  '0064500759008730098800036'.
40       02 FILLER     PIC  X(25)  VALUE  '0067600807009380106900040'.
         02 FILLER     PIC  X(25)  VALUE  '0071700868010190117000045'.
         02 FILLER     PIC  X(25)  VALUE  '0076300936011090128200050'.
         02 FILLER     PIC  X(25)  VALUE  '0080801005012020139900055'.
         02 FILLER     PIC  X(25)  VALUE  '0086501089013130153800062'.
45       02 FILLER     PIC  X(25)  VALUE  '0091501166014170166800068'.
         02 FILLER     PIC  X(25)  VALUE  '0097301251015290180700074'.
         02 FILLER     PIC  X(25)  VALUE  '0103201340016490195700081'.
         02 FILLER     PIC  X(25)  VALUE  '0110201444017870212900089'.
         02 FILLER     PIC  X(25)  VALUE  '0117401553019310231000097'.
50       02 FILLER     PIC  X(25)  VALUE  '0125301671020900250800106'.
         02 FILLER     PIC  X(25)  VALUE  '0134101804022670273000117'.
         02 FILLER     PIC  X(25)  VALUE  '0144101952024620297300128'.
         02 FILLER     PIC  X(25)  VALUE  '0154702111026750323900140'.
         02 FILLER     PIC  X(25)  VALUE  '0166402286029080353000153'.
55       02 FILLER     PIC  X(25)  VALUE  '0178602472031570384200168'.
         02 FILLER     PIC  X(25)  VALUE  '0192802683034380419400184'.
         02 FILLER     PIC  X(25)  VALUE  '0208302916037480458000201'.
         02 FILLER     PIC  X(25)  VALUE  '0224903165040820499800220'.
         02 FILLER     PIC  X(25)  VALUE  '0243703445044540546200241'.
60       02 FILLER     PIC  X(25)  VALUE  '0263703746048560596600264'.
         02 FILLER     PIC  X(25)  VALUE  '0286304084053050652500290'.
         02 FILLER     PIC  X(25)  VALUE  '0310604448057900713300317'.
         02 FILLER     PIC  X(25)  VALUE  '0337404850063260780200347'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000380'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000416'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000455'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000498'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000545'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000596'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *-------------------(   1 HOI  WOMAN  RISK  LYO )--------------*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0020300210002170022300006'.
         02 FILLER     PIC  X(25)  VALUE  '0020800218002270023600007'.
20       02 FILLER     PIC  X(25)  VALUE  '0021400226002380025000007'.
         02 FILLER     PIC  X(25)  VALUE  '0022000235002500026500008'.
         02 FILLER     PIC  X(25)  VALUE  '0022400242002590027600008'.
         02 FILLER     PIC  X(25)  VALUE  '0022800247002650028400009'.
         02 FILLER     PIC  X(25)  VALUE  '0023000249002690028800009'.
25       02 FILLER     PIC  X(25)  VALUE  '0023100251002710029100009'.
         02 FILLER     PIC  X(25)  VALUE  '0023200252002730029300009'.
         02 FILLER     PIC  X(25)  VALUE  '0023300255002760029700009'.
         02 FILLER     PIC  X(25)  VALUE  '0023500257002800030200009'.
         02 FILLER     PIC  X(25)  VALUE  '0023900263002860031000010'.
30       02 FILLER     PIC  X(25)  VALUE  '0024100267002920031700010'.
         02 FILLER     PIC  X(25)  VALUE  '0024600273003000032800011'.
         02 FILLER     PIC  X(25)  VALUE  '0025000280003090033800011'.
         02 FILLER     PIC  X(25)  VALUE  '0025400285003160034700012'.
         02 FILLER     PIC  X(25)  VALUE  '0025800291003250035800012'.
35       02 FILLER     PIC  X(25)  VALUE  '0026300299003350037100013'.
         02 FILLER     PIC  X(25)  VALUE  '0027000310003490038800013'.
         02 FILLER     PIC  X(25)  VALUE  '0027700320003630040500014'.
         02 FILLER     PIC  X(25)  VALUE  '0028400331003790042700016'.
         02 FILLER     PIC  X(25)  VALUE  '0029600350004030045700017'.
40       02 FILLER     PIC  X(25)  VALUE  '0030800368004280048700018'.
         02 FILLER     PIC  X(25)  VALUE  '0032300390004570052400020'.
         02 FILLER     PIC  X(25)  VALUE  '0033900414004890056400022'.
         02 FILLER     PIC  X(25)  VALUE  '0035600439005220060500024'.
         02 FILLER     PIC  X(25)  VALUE  '0037400467005990065100026'.
45       02 FILLER     PIC  X(25)  VALUE  '0039400496005980070000028'.
         02 FILLER     PIC  X(25)  VALUE  '0041600528006410075300031'.
         02 FILLER     PIC  X(25)  VALUE  '0044000565006890081400033'.
         02 FILLER     PIC  X(25)  VALUE  '0046600604007420087900036'.
         02 FILLER     PIC  X(25)  VALUE  '0049600648008000095200040'.
50       02 FILLER     PIC  X(25)  VALUE  '0053000699008670103600044'.
         02 FILLER     PIC  X(25)  VALUE  '0056200748009350112200048'.
         02 FILLER     PIC  X(25)  VALUE  '0060300810010170122400052'.
         02 FILLER     PIC  X(25)  VALUE  '0064800877011050133400057'.
         02 FILLER     PIC  X(25)  VALUE  '0069700950012030145600063'.
55       02 FILLER     PIC  X(25)  VALUE  '0075101031013110159100069'.
         02 FILLER     PIC  X(25)  VALUE  '0081001119014280173800076'.
         02 FILLER     PIC  X(25)  VALUE  '0087001211015520189200083'.
         02 FILLER     PIC  X(25)  VALUE  '0094101316016920206700091'.
         02 FILLER     PIC  X(25)  VALUE  '0101801432018450225900100'.
60       02 FILLER     PIC  X(25)  VALUE  '0110201557020130246800110'.
         02 FILLER     PIC  X(25)  VALUE  '0119201693021940269500120'.
         02 FILLER     PIC  X(25)  VALUE  '0129401845023970294800132'.
         02 FILLER     PIC  X(25)  VALUE  '0147002014026210322800145'.
         02 FILLER     PIC  X(25)  VALUE  '0152502193028610352800158'.
65       02 FILLER     PIC  X(25)  VALUE  '0166002394031290386300174'.
         02 FILLER     PIC  X(25)  VALUE  '0180402612034200422700190'.
         02 FILLER     PIC  X(25)  VALUE  '0196802855037430463100209'.
         02 FILLER     PIC  X(25)  VALUE  '0214303120040970507400229'.
         02 FILLER     PIC  X(25)  VALUE  '0234103415044890556300251'.
70       02 FILLER     PIC  X(25)  VALUE  '0255103731049110609100275'.
         02 FILLER     PIC  X(25)  VALUE  '0278804085053820667900302'.
         02 FILLER     PIC  X(25)  VALUE  '0304304468058930731800331'.
         02 FILLER     PIC  X(25)  VALUE  '0332404890064560802200362'.
         02 FILLER     PIC  X(25)  VALUE  '0363805358070790879900397'.
75       02 FILLER     PIC  X(25)  VALUE  '0397605866077560964600435'.
         02 FILLER     PIC  X(25)  VALUE  '0434906425085020000000476'.
         02 FILLER     PIC  X(25)  VALUE  '0475707038093190000000522'.
         02 FILLER     PIC  X(25)  VALUE  '0520407709000000000000571'.
      *--------------(  2 HOI   NOBOK  MAN  RISK  LYO )--------------*
15       02 FILLER     PIC  X(25)  VALUE  '0019900203002070021100005'.
         02 FILLER     PIC  X(25)  VALUE  '0021100218002260023300006'.
         02 FILLER     PIC  X(25)  VALUE  '0022300235002470025900007'.
         02 FILLER     PIC  X(25)  VALUE  '0023500251002680028500008'.
         02 FILLER     PIC  X(25)  VALUE  '0025100274002960031800009'.
20       02 FILLER     PIC  X(25)  VALUE  '0043600442004490045500011'.
         02 FILLER     PIC  X(25)  VALUE  '0046200477004910050600013'.
         02 FILLER     PIC  X(25)  VALUE  '0048400507005300055400015'.
         02 FILLER     PIC  X(25)  VALUE  '0050600536005670059800017'.
         02 FILLER     PIC  X(25)  VALUE  '0051500549005830061600017'.
25       02 FILLER     PIC  X(25)  VALUE  '0051900553005880062200018'.
         02 FILLER     PIC  X(25)  VALUE  '0052200558005930062800018'.
         02 FILLER     PIC  X(25)  VALUE  '0051600550005830061700017'.
         02 FILLER     PIC  X(25)  VALUE  '0050900540005710060200017'.
         02 FILLER     PIC  X(25)  VALUE  '0050200532005610059100016'.
30       02 FILLER     PIC  X(25)  VALUE  '0050400534005640059400017'.
         02 FILLER     PIC  X(25)  VALUE  '0050900540005710060300017'.
         02 FILLER     PIC  X(25)  VALUE  '0052000555005890062400018'.
         02 FILLER     PIC  X(25)  VALUE  '0053500574006140065400019'.
         02 FILLER     PIC  X(25)  VALUE  '0055200598006430068900020'.
35       02 FILLER     PIC  X(25)  VALUE  '0057300625006770072900022'.
         02 FILLER     PIC  X(25)  VALUE  '0059600656007150077500024'.
         02 FILLER     PIC  X(25)  VALUE  '0062200691007600083000026'.
         02 FILLER     PIC  X(25)  VALUE  '0065600736008170089700028'.
         02 FILLER     PIC  X(25)  VALUE  '0069300786008780097100031'.
40       02 FILLER     PIC  X(25)  VALUE  '0086800958010480113880035'.
         02 FILLER     PIC  X(25)  VALUE  '0092601035011440125300039'.
         02 FILLER     PIC  X(25)  VALUE  '0098801118012480137800044'.
         02 FILLER     PIC  X(25)  VALUE  '0105901212013650151800049'.
         02 FILLER     PIC  X(25)  VALUE  '0113201310014880166600055'.
45       02 FILLER     PIC  X(25)  VALUE  '0122201429016360184300062'.
         02 FILLER     PIC  X(25)  VALUE  '0132201562018030204300070'.
         02 FILLER     PIC  X(25)  VALUE  '0143301711019890226700078'.
         02 FILLER     PIC  X(25)  VALUE  '0154701862021780249400087'.
         02 FILLER     PIC  X(25)  VALUE  '0166202016023700272400096'.
50       02 FILLER     PIC  X(25)  VALUE  '0177602168025600295200105'.
         02 FILLER     PIC  X(25)  VALUE  '0190302337027710320500114'.
         02 FILLER     PIC  X(25)  VALUE  '0205102534030180350200126'.
         02 FILLER     PIC  X(25)  VALUE  '0222902772033140385700139'.
         02 FILLER     PIC  X(25)  VALUE  '0241103014036180422200153'.
55       02 FILLER     PIC  X(25)  VALUE  '0260503272039380460500168'.
         02 FILLER     PIC  X(25)  VALUE  '0281403551042880502500184'.
         02 FILLER     PIC  X(25)  VALUE  '0304503859046730548700201'.
         02 FILLER     PIC  X(25)  VALUE  '0329704195050920599000220'.
         02 FILLER     PIC  X(25)  VALUE  '0355404538055230650700240'.
60       02 FILLER     PIC  X(25)  VALUE  '0398305038060930714800261'.
         02 FILLER     PIC  X(25)  VALUE  '0428505441065980775400284'.
         02 FILLER     PIC  X(25)  VALUE  '0461705882071470841200309'.
         02 FILLER     PIC  X(25)  VALUE  '0497106356077400912500335'.
         02 FILLER     PIC  X(25)  VALUE  '0536206876083900990400365'.
65       02 FILLER     PIC  X(25)  VALUE  '0579007445091011075600396'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *------------(  2 HOI   NOBOK  WOMAN  RISK  LYO )--------------*
15       02 FILLER     PIC  X(25)  VALUE  '0014100146001510015700004'.
         02 FILLER     PIC  X(25)  VALUE  '0014100146001510015700004'.
         02 FILLER     PIC  X(25)  VALUE  '0014100146001510015700004'.
         02 FILLER     PIC  X(25)  VALUE  '0014100146001520015700004'.
         02 FILLER     PIC  X(25)  VALUE  '0014200148001540016000004'.
20       02 FILLER     PIC  X(25)  VALUE  '0016300168001730017700005'.
         02 FILLER     PIC  X(25)  VALUE  '0017200180001870019500005'.
         02 FILLER     PIC  X(25)  VALUE  '0018100192002020021300006'.
         02 FILLER     PIC  X(25)  VALUE  '0019000203002170023000007'.
         02 FILLER     PIC  X(25)  VALUE  '0019400209002230023800007'.
25       02 FILLER     PIC  X(25)  VALUE  '0019300207002210023600007'.
         02 FILLER     PIC  X(25)  VALUE  '0019000204002170023100007'.
         02 FILLER     PIC  X(25)  VALUE  '0018900202002150022800007'.
         02 FILLER     PIC  X(25)  VALUE  '0019000204002170023100007'.
         02 FILLER     PIC  X(25)  VALUE  '0019500211002260024100007'.
30       02 FILLER     PIC  X(25)  VALUE  '0020300221002390025600008'.
         02 FILLER     PIC  X(25)  VALUE  '0021200233002530027400008'.
         02 FILLER     PIC  X(25)  VALUE  '0022200246002710029500009'.
         02 FILLER     PIC  X(25)  VALUE  '0023300260002880031500010'.
         02 FILLER     PIC  X(25)  VALUE  '0024300274003050033600011'.
35       02 FILLER     PIC  X(25)  VALUE  '0025300288003220035600011'.
         02 FILLER     PIC  X(25)  VALUE  '0026400301003390037700012'.
         02 FILLER     PIC  X(25)  VALUE  '0027200312003520039300013'.
         02 FILLER     PIC  X(25)  VALUE  '0027800321003630040600013'.
         02 FILLER     PIC  X(25)  VALUE  '0028400328003720041600014'.
40       02 FILLER     PIC  X(25)  VALUE  '0033300374004150045600014'.
         02 FILLER     PIC  X(25)  VALUE  '0034500390004350048000015'.
         02 FILLER     PIC  X(25)  VALUE  '0036600418004700052100017'.
         02 FILLER     PIC  X(25)  VALUE  '0039800460005220058400019'.
         02 FILLER     PIC  X(25)  VALUE  '0043800514005890066500022'.
45       02 FILLER     PIC  X(25)  VALUE  '0048200572006610075100026'.
         02 FILLER     PIC  X(25)  VALUE  '0052700632007360084100029'.
         02 FILLER     PIC  X(25)  VALUE  '0057000689008080092700033'.
         02 FILLER     PIC  X(25)  VALUE  '0061000743008750100800036'.
         02 FILLER     PIC  X(25)  VALUE  '0065000796009420108700039'.
50       02 FILLER     PIC  X(25)  VALUE  '0069300854010150117600042'.
         02 FILLER     PIC  X(25)  VALUE  '0074200919010960127300046'.
         02 FILLER     PIC  X(25)  VALUE  '0079600990011850138000050'.
         02 FILLER     PIC  X(25)  VALUE  '0085001063012750148800054'.
         02 FILLER     PIC  X(25)  VALUE  '0090001129013580158700058'.
55       02 FILLER     PIC  X(25)  VALUE  '0097401227014810173400064'.
         02 FILLER     PIC  X(25)  VALUE  '0105301334016150189500070'.
         02 FILLER     PIC  X(25)  VALUE  '0114401454017650207600077'.
         02 FILLER     PIC  X(25)  VALUE  '0124201585019280227200084'.
         02 FILLER     PIC  X(25)  VALUE  '0135201731021100248900093'.
60       02 FILLER     PIC  X(25)  VALUE  '0160402004024040280400102'.
         02 FILLER     PIC  X(25)  VALUE  '0173702180026240306700112'.
         02 FILLER     PIC  X(25)  VALUE  '0188002372028630335500123'.
         02 FILLER     PIC  X(25)  VALUE  '0204102586031310367600135'.
         02 FILLER     PIC  X(25)  VALUE  '0221602819034220402600149'.
65       02 FILLER     PIC  X(25)  VALUE  '0240803075037420440900163'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *--------------(  2 HOI  NOJEOK  MAN  RISK  LYO )--------------*
15       02 FILLER     PIC  X(25)  VALUE  '0020300203002030020300000'.
         02 FILLER     PIC  X(25)  VALUE  '0021800218002180021800000'.
         02 FILLER     PIC  X(25)  VALUE  '0023500235002350023500000'.
         02 FILLER     PIC  X(25)  VALUE  '0025100251002510025100000'.
         02 FILLER     PIC  X(25)  VALUE  '0027400274002740027400000'.
20       02 FILLER     PIC  X(25)  VALUE  '0044200442004420044200000'.
         02 FILLER     PIC  X(25)  VALUE  '0047700477004770047700000'.
         02 FILLER     PIC  X(25)  VALUE  '0050700507005070050700000'.
         02 FILLER     PIC  X(25)  VALUE  '0053600536005360053600000'.
         02 FILLER     PIC  X(25)  VALUE  '0054900549005490054900000'.
25       02 FILLER     PIC  X(25)  VALUE  '0055300553005530055300000'.
         02 FILLER     PIC  X(25)  VALUE  '0055800558005580055800000'.
         02 FILLER     PIC  X(25)  VALUE  '0055000550005500055000000'.
         02 FILLER     PIC  X(25)  VALUE  '0054000540005400054000000'.
         02 FILLER     PIC  X(25)  VALUE  '0053200532005320053200000'.
30       02 FILLER     PIC  X(25)  VALUE  '0053400534005340053400000'.
         02 FILLER     PIC  X(25)  VALUE  '0054000540005400054000000'.
         02 FILLER     PIC  X(25)  VALUE  '0055500555005550055500000'.
         02 FILLER     PIC  X(25)  VALUE  '0057400574005740057400000'.
         02 FILLER     PIC  X(25)  VALUE  '0059800598005980059800000'.
35       02 FILLER     PIC  X(25)  VALUE  '0062500625006250062500000'.
         02 FILLER     PIC  X(25)  VALUE  '0065600656006560065600000'.
         02 FILLER     PIC  X(25)  VALUE  '0069100691006910069100000'.
         02 FILLER     PIC  X(25)  VALUE  '0073600736007360073600000'.
         02 FILLER     PIC  X(25)  VALUE  '0078600786007860078600000'.
40       02 FILLER     PIC  X(25)  VALUE  '0095800958009580095800000'.
         02 FILLER     PIC  X(25)  VALUE  '0103501035010350103500000'.
         02 FILLER     PIC  X(25)  VALUE  '0111801118011180111800000'.
         02 FILLER     PIC  X(25)  VALUE  '0121201212012120121200000'.
         02 FILLER     PIC  X(25)  VALUE  '0131001310013100131000000'.
45       02 FILLER     PIC  X(25)  VALUE  '0142901429014290142900000'.
         02 FILLER     PIC  X(25)  VALUE  '0156201562015620156200000'.
         02 FILLER     PIC  X(25)  VALUE  '0171101711017110171100000'.
         02 FILLER     PIC  X(25)  VALUE  '0186201862018620186200000'.
         02 FILLER     PIC  X(25)  VALUE  '0201602016020160201600000'.
50       02 FILLER     PIC  X(25)  VALUE  '0216802168021680216800000'.
         02 FILLER     PIC  X(25)  VALUE  '0233702337023370233700000'.
         02 FILLER     PIC  X(25)  VALUE  '0253402534025340253400000'.
         02 FILLER     PIC  X(25)  VALUE  '0277202772027720277200000'.
         02 FILLER     PIC  X(25)  VALUE  '0301403014030140301400000'.
55       02 FILLER     PIC  X(25)  VALUE  '0327203272032720327200000'.
         02 FILLER     PIC  X(25)  VALUE  '0355103551035510355100000'.
         02 FILLER     PIC  X(25)  VALUE  '0385903859038590385900000'.
         02 FILLER     PIC  X(25)  VALUE  '0419504195041950419500000'.
         02 FILLER     PIC  X(25)  VALUE  '0453804538045380453800000'.
60       02 FILLER     PIC  X(25)  VALUE  '0503805038050380503800000'.
         02 FILLER     PIC  X(25)  VALUE  '0544105441054410544100000'.
         02 FILLER     PIC  X(25)  VALUE  '0588205882058820588200000'.
         02 FILLER     PIC  X(25)  VALUE  '0635606356063560635600000'.
         02 FILLER     PIC  X(25)  VALUE  '0687606876068760687600000'.
65       02 FILLER     PIC  X(25)  VALUE  '0744507445074450744500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *------------(  2 HOI  NOJEOK  WOMAN  RISK  LYO )--------------*
15       02 FILLER     PIC  X(25)  VALUE  '0014600146001460014600000'.
         02 FILLER     PIC  X(25)  VALUE  '0014600146001460014600000'.
         02 FILLER     PIC  X(25)  VALUE  '0014600146001460014600000'.
         02 FILLER     PIC  X(25)  VALUE  '0014600146001460014600000'.
         02 FILLER     PIC  X(25)  VALUE  '0014800148001480014800000'.
20       02 FILLER     PIC  X(25)  VALUE  '0016800168001680016800000'.
         02 FILLER     PIC  X(25)  VALUE  '0018000180001800018000000'.
         02 FILLER     PIC  X(25)  VALUE  '0019200192001920019200000'.
         02 FILLER     PIC  X(25)  VALUE  '0020300203002030020300000'.
         02 FILLER     PIC  X(25)  VALUE  '0020900209002090020900000'.
25       02 FILLER     PIC  X(25)  VALUE  '0020700207002070020700000'.
         02 FILLER     PIC  X(25)  VALUE  '0020400204002040020400000'.
         02 FILLER     PIC  X(25)  VALUE  '0020200202002020020200000'.
         02 FILLER     PIC  X(25)  VALUE  '0020400204002040020400000'.
         02 FILLER     PIC  X(25)  VALUE  '0021100211002110021100000'.
30       02 FILLER     PIC  X(25)  VALUE  '0022100221002210022100000'.
         02 FILLER     PIC  X(25)  VALUE  '0023300233002330023300000'.
         02 FILLER     PIC  X(25)  VALUE  '0024600246002460024600000'.
         02 FILLER     PIC  X(25)  VALUE  '0026000260002600026000000'.
         02 FILLER     PIC  X(25)  VALUE  '0027400274002740027400000'.
35       02 FILLER     PIC  X(25)  VALUE  '0028800288002880028800000'.
         02 FILLER     PIC  X(25)  VALUE  '0030100301003010030100000'.
         02 FILLER     PIC  X(25)  VALUE  '0031200312003120031200000'.
         02 FILLER     PIC  X(25)  VALUE  '0032100321003210032100000'.
         02 FILLER     PIC  X(25)  VALUE  '0032800328003280032800000'.
40       02 FILLER     PIC  X(25)  VALUE  '0037400374003740037400000'.
         02 FILLER     PIC  X(25)  VALUE  '0039000390003900039000000'.
         02 FILLER     PIC  X(25)  VALUE  '0041800418004180041800000'.
         02 FILLER     PIC  X(25)  VALUE  '0046000460004600046000000'.
         02 FILLER     PIC  X(25)  VALUE  '0051400514005140051400000'.
45       02 FILLER     PIC  X(25)  VALUE  '0057200572005720057200000'.
         02 FILLER     PIC  X(25)  VALUE  '0063200632006320063200000'.
         02 FILLER     PIC  X(25)  VALUE  '0068900689006890068900000'.
         02 FILLER     PIC  X(25)  VALUE  '0074300743007430074300000'.
         02 FILLER     PIC  X(25)  VALUE  '0079600796007960079600000'.
50       02 FILLER     PIC  X(25)  VALUE  '0085400854008540085400000'.
         02 FILLER     PIC  X(25)  VALUE  '0091900919009190091900000'.
         02 FILLER     PIC  X(25)  VALUE  '0099000990009900099000000'.
         02 FILLER     PIC  X(25)  VALUE  '0106301063010630106300000'.
         02 FILLER     PIC  X(25)  VALUE  '0112901129011290112900000'.
55       02 FILLER     PIC  X(25)  VALUE  '0122701227012270122700000'.
         02 FILLER     PIC  X(25)  VALUE  '0133401334013340133400000'.
         02 FILLER     PIC  X(25)  VALUE  '0145401454014540145400000'.
         02 FILLER     PIC  X(25)  VALUE  '0158501585015850158500000'.
         02 FILLER     PIC  X(25)  VALUE  '0173101731017310173100000'.
60       02 FILLER     PIC  X(25)  VALUE  '0200402004020040200400000'.
         02 FILLER     PIC  X(25)  VALUE  '0218002180021800218000000'.
         02 FILLER     PIC  X(25)  VALUE  '0237202372023720237200000'.
         02 FILLER     PIC  X(25)  VALUE  '0258602586025860258600000'.
         02 FILLER     PIC  X(25)  VALUE  '0281902819028190281900000'.
65       02 FILLER     PIC  X(25)  VALUE  '0307503075030750307500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *------------(  2 HOI  NON-TAX  MAN  RISK  LYO )---------------*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000027700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000028200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000029500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000031400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000033700000'.
20       02 FILLER     PIC  X(25)  VALUE  '0000000000000000061800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000065200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000068500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000071600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000072200000'.
25       02 FILLER     PIC  X(25)  VALUE  '0000000000000000072500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000073100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000072400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000071500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000070800000'.
30       02 FILLER     PIC  X(25)  VALUE  '0000000000000000071100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000071800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000072900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000075100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000077400000'.
35       02 FILLER     PIC  X(25)  VALUE  '0000000000000000080100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000083400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000087200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000091000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000096100000'.
40       02 FILLER     PIC  X(25)  VALUE  '0000000000000000120900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000128600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000137400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000146500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000156300000'.
45       02 FILLER     PIC  X(25)  VALUE  '0000000000000000168300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000181800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000196500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000211800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000226500000'.
50       02 FILLER     PIC  X(25)  VALUE  '0000000000000000242200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000258700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000279500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000302800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000327100000'.
55       02 FILLER     PIC  X(25)  VALUE  '0000000000000000353200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000380800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000411800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000445500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000480100000'.
60       02 FILLER     PIC  X(25)  VALUE  '0000000000000000531900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000572200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000615800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000664200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000715600000'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000773100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000834800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000901600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000974600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000001054400000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000001140800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *------------(  2 HOI  NON-TAX  WOMAN  RISK  LYO )-------------*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000019000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000018800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000018400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000018400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000018500000'.
20       02 FILLER     PIC  X(25)  VALUE  '0000000000000000020500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000021700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000023100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000024200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000024700000'.
25       02 FILLER     PIC  X(25)  VALUE  '0000000000000000024600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000024300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000024100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000024300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000025000000'.
30       02 FILLER     PIC  X(25)  VALUE  '0000000000000000026000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000027200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000028400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000029900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000031300000'.
35       02 FILLER     PIC  X(25)  VALUE  '0000000000000000032600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000034000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000035200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000036000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000036700000'.
40       02 FILLER     PIC  X(25)  VALUE  '0000000000000000045300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000047100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000049900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000053300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000058700000'.
45       02 FILLER     PIC  X(25)  VALUE  '0000000000000000064700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000070600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000076500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000081700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000087200000'.
50       02 FILLER     PIC  X(25)  VALUE  '0000000000000000093300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000100000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000106800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000114100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000120900000'.
55       02 FILLER     PIC  X(25)  VALUE  '0000000000000000130700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000141800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000153900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000166000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000180700000'.
60       02 FILLER     PIC  X(25)  VALUE  '0000000000000000217400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000235500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000254200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000276100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000298900000'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000325400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000352900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000384400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000419000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000457300000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000497700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *--------------(  3 HOI   NOBOK  MAN  RISK  LYO )--------------*
15       02 FILLER     PIC  X(25)  VALUE  '0028800305003210033800009'.
         02 FILLER     PIC  X(25)  VALUE  '0029500313003320035000010'.
         02 FILLER     PIC  X(25)  VALUE  '0030000320003410036100010'.
         02 FILLER     PIC  X(25)  VALUE  '0030700329003510037400011'.
         02 FILLER     PIC  X(25)  VALUE  '0032200350003770040500012'.
20       02 FILLER     PIC  X(25)  VALUE  '0055800563005680057200014'.
         02 FILLER     PIC  X(25)  VALUE  '0058500598006110062400016'.
         02 FILLER     PIC  X(25)  VALUE  '0061000631006520067300018'.
         02 FILLER     PIC  X(25)  VALUE  '0062300650006760070300019'.
         02 FILLER     PIC  X(25)  VALUE  '0063100661006900072000019'.
25       02 FILLER     PIC  X(25)  VALUE  '0062900657006850071300019'.
         02 FILLER     PIC  X(25)  VALUE  '0062200648006730069900019'.
         02 FILLER     PIC  X(25)  VALUE  '0061100633006550067700018'.
         02 FILLER     PIC  X(25)  VALUE  '0059800616006350065300017'.
         02 FILLER     PIC  X(25)  VALUE  '0059100607006230063900016'.
30       02 FILLER     PIC  X(25)  VALUE  '0053400556005780060100016'.
         02 FILLER     PIC  X(25)  VALUE  '0053300556005790060200016'.
         02 FILLER     PIC  X(25)  VALUE  '0053700562005860061100016'.
         02 FILLER     PIC  X(25)  VALUE  '0054700575006020063000017'.
         02 FILLER     PIC  X(25)  VALUE  '0055900591006230065400018'.
35       02 FILLER     PIC  X(25)  VALUE  '0057500611006470068400019'.
         02 FILLER     PIC  X(25)  VALUE  '0059400636006790072200021'.
         02 FILLER     PIC  X(25)  VALUE  '0061300663007130076300022'.
         02 FILLER     PIC  X(25)  VALUE  '0063600694007510080900024'.
         02 FILLER     PIC  X(25)  VALUE  '0066300729007950086100026'.
40       02 FILLER     PIC  X(25)  VALUE  '0075500822008890095600028'.
         02 FILLER     PIC  X(25)  VALUE  '0079100870009480102700031'.
         02 FILLER     PIC  X(25)  VALUE  '0083200923010150110700034'.
         02 FILLER     PIC  X(25)  VALUE  '0087100977010830118800037'.
         02 FILLER     PIC  X(25)  VALUE  '0092201044011670128900041'.
45       02 FILLER     PIC  X(25)  VALUE  '0097601117012580140000046'.
         02 FILLER     PIC  X(25)  VALUE  '0104301205013670153000051'.
         02 FILLER     PIC  X(25)  VALUE  '0111401300014870167400056'.
         02 FILLER     PIC  X(25)  VALUE  '0119501408016200183300062'.
         02 FILLER     PIC  X(25)  VALUE  '0128401527017700201300069'.
50       02 FILLER     PIC  X(25)  VALUE  '0150501763020220228000077'.
         02 FILLER     PIC  X(25)  VALUE  '0160901903021980249300085'.
         02 FILLER     PIC  X(25)  VALUE  '0172402056023880272100094'.
         02 FILLER     PIC  X(25)  VALUE  '0184202213025840295500103'.
         02 FILLER     PIC  X(25)  VALUE  '0198002398028150323300113'.
55       02 FILLER     PIC  X(25)  VALUE  '0214802621030940356600126'.
         02 FILLER     PIC  X(25)  VALUE  '0234802888034270396700141'.
         02 FILLER     PIC  X(25)  VALUE  '0258703207038260444500160'.
         02 FILLER     PIC  X(25)  VALUE  '0285903568042780498700180'.
         02 FILLER     PIC  X(25)  VALUE  '0316603979047910560300204'.
60       02 FILLER     PIC  X(25)  VALUE  '0367504581054880639400230'.
         02 FILLER     PIC  X(25)  VALUE  '0405005081061120714400259'.
         02 FILLER     PIC  X(25)  VALUE  '0445605621067860795200289'.
         02 FILLER     PIC  X(25)  VALUE  '0488506193075020881000321'.
         02 FILLER     PIC  X(25)  VALUE  '0533306790082460970300355'.
65       02 FILLER     PIC  X(25)  VALUE  '0578907399090081061800389'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *------------(  3 HOI   NOBOK  WOMAN  RISK  LYO )--------------*
15       02 FILLER     PIC  X(25)  VALUE  '0014400153001630017200005'.
         02 FILLER     PIC  X(25)  VALUE  '0014700157001670017700005'.
         02 FILLER     PIC  X(25)  VALUE  '0014800159001690017900005'.
         02 FILLER     PIC  X(25)  VALUE  '0014700157001670017700005'.
         02 FILLER     PIC  X(25)  VALUE  '0014600155001650017500005'.
20       02 FILLER     PIC  X(25)  VALUE  '0018800192001960020100005'.
         02 FILLER     PIC  X(25)  VALUE  '0019300199002050021100005'.
         02 FILLER     PIC  X(25)  VALUE  '0019900207002150022300006'.
         02 FILLER     PIC  X(25)  VALUE  '0020600216002260023600006'.
         02 FILLER     PIC  X(25)  VALUE  '0021100223002340024600007'.
25       02 FILLER     PIC  X(25)  VALUE  '0021500228002410025400007'.
         02 FILLER     PIC  X(25)  VALUE  '0021600230002450026000007'.
         02 FILLER     PIC  X(25)  VALUE  '0021800234002490026500008'.
         02 FILLER     PIC  X(25)  VALUE  '0022200239002560027300008'.
         02 FILLER     PIC  X(25)  VALUE  '0022700246002640028300008'.
30       02 FILLER     PIC  X(25)  VALUE  '0024600264002810029900009'.
         02 FILLER     PIC  X(25)  VALUE  '0025100271002900030900009'.
         02 FILLER     PIC  X(25)  VALUE  '0025600277002990032000009'.
         02 FILLER     PIC  X(25)  VALUE  '0026300286003090033300010'.
         02 FILLER     PIC  X(25)  VALUE  '0026900295003200034500010'.
35       02 FILLER     PIC  X(25)  VALUE  '0027700305003330036100011'.
         02 FILLER     PIC  X(25)  VALUE  '0028600317003480037900012'.
         02 FILLER     PIC  X(25)  VALUE  '0029100325003590039300012'.
         02 FILLER     PIC  X(25)  VALUE  '0029900336003720040900013'.
         02 FILLER     PIC  X(25)  VALUE  '0030800348003870042700014'.
40       02 FILLER     PIC  X(25)  VALUE  '0034000380004200046000014'.
         02 FILLER     PIC  X(25)  VALUE  '0035000394004370048100015'.
         02 FILLER     PIC  X(25)  VALUE  '0036500413004610050900016'.
         02 FILLER     PIC  X(25)  VALUE  '0038100434004880054100018'.
         02 FILLER     PIC  X(25)  VALUE  '0040200462005220058300019'.
45       02 FILLER     PIC  X(25)  VALUE  '0042400492005600062800021'.
         02 FILLER     PIC  X(25)  VALUE  '0045000526006020067800023'.
         02 FILLER     PIC  X(25)  VALUE  '0047400558006420072600025'.
         02 FILLER     PIC  X(25)  VALUE  '0049500587006780076900026'.
         02 FILLER     PIC  X(25)  VALUE  '0052100621007200082000028'.
50       02 FILLER     PIC  X(25)  VALUE  '0059200696008010090500031'.
         02 FILLER     PIC  X(25)  VALUE  '0062900745008620097800033'.
         02 FILLER     PIC  X(25)  VALUE  '0066900798009280105700037'.
         02 FILLER     PIC  X(25)  VALUE  '0071600861010060115100040'.
         02 FILLER     PIC  X(25)  VALUE  '0076500926010870124800044'.
55       02 FILLER     PIC  X(25)  VALUE  '0082101002011820136300048'.
         02 FILLER     PIC  X(25)  VALUE  '0089201095012990150300054'.
         02 FILLER     PIC  X(25)  VALUE  '0098201216014500168300061'.
         02 FILLER     PIC  X(25)  VALUE  '0109101360016300189900069'.
         02 FILLER     PIC  X(25)  VALUE  '0120701516018250213400078'.
60       02 FILLER     PIC  X(25)  VALUE  '0145101783021150244700087'.
         02 FILLER     PIC  X(25)  VALUE  '0158301959023350271100098'.
         02 FILLER     PIC  X(25)  VALUE  '0171602137025570297800108'.
         02 FILLER     PIC  X(25)  VALUE  '0186302332028010327100119'.
         02 FILLER     PIC  X(25)  VALUE  '0202602550030740359700131'.
65       02 FILLER     PIC  X(25)  VALUE  '0220602790033740395800145'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *--------------(  3 HOI  NOJEOK  MAN  RISK  LYO )--------------*
15       02 FILLER     PIC  X(25)  VALUE  '0030500305003050030500000'.
         02 FILLER     PIC  X(25)  VALUE  '0031300313003130031300000'.
         02 FILLER     PIC  X(25)  VALUE  '0032000320003200032000000'.
         02 FILLER     PIC  X(25)  VALUE  '0032900329003290032900000'.
         02 FILLER     PIC  X(25)  VALUE  '0035000350003500035000000'.
20       02 FILLER     PIC  X(25)  VALUE  '0056300563005630056300000'.
         02 FILLER     PIC  X(25)  VALUE  '0059800598005980059800000'.
         02 FILLER     PIC  X(25)  VALUE  '0063100631006310063100000'.
         02 FILLER     PIC  X(25)  VALUE  '0065000650006500065000000'.
         02 FILLER     PIC  X(25)  VALUE  '0066100661006610066100000'.
25       02 FILLER     PIC  X(25)  VALUE  '0065700657006570065700000'.
         02 FILLER     PIC  X(25)  VALUE  '0064800648006480064800000'.
         02 FILLER     PIC  X(25)  VALUE  '0063300633006330063300000'.
         02 FILLER     PIC  X(25)  VALUE  '0061600616006160061600000'.
         02 FILLER     PIC  X(25)  VALUE  '0060700607006070060700000'.
30       02 FILLER     PIC  X(25)  VALUE  '0055600556005560055600000'.
         02 FILLER     PIC  X(25)  VALUE  '0055600556005560055600000'.
         02 FILLER     PIC  X(25)  VALUE  '0056200562005620056200000'.
         02 FILLER     PIC  X(25)  VALUE  '0057500575005750057500000'.
         02 FILLER     PIC  X(25)  VALUE  '0059100591005910059100000'.
35       02 FILLER     PIC  X(25)  VALUE  '0061100611006110061100000'.
         02 FILLER     PIC  X(25)  VALUE  '0063600636006360063600000'.
         02 FILLER     PIC  X(25)  VALUE  '0066300663006630066300000'.
         02 FILLER     PIC  X(25)  VALUE  '0069400694006940069400000'.
         02 FILLER     PIC  X(25)  VALUE  '0072900729007290072900000'.
40       02 FILLER     PIC  X(25)  VALUE  '0082200822008220082200000'.
         02 FILLER     PIC  X(25)  VALUE  '0087000870008700087000000'.
         02 FILLER     PIC  X(25)  VALUE  '0092300923009230092300000'.
         02 FILLER     PIC  X(25)  VALUE  '0097700977009770097700000'.
         02 FILLER     PIC  X(25)  VALUE  '0104401044010440104400000'.
45       02 FILLER     PIC  X(25)  VALUE  '0111701117011170111700000'.
         02 FILLER     PIC  X(25)  VALUE  '0120501205012050120500000'.
         02 FILLER     PIC  X(25)  VALUE  '0130001300013000130000000'.
         02 FILLER     PIC  X(25)  VALUE  '0140801408014080140800000'.
         02 FILLER     PIC  X(25)  VALUE  '0152701527015270152700000'.
50       02 FILLER     PIC  X(25)  VALUE  '0176301763017630176300000'.
         02 FILLER     PIC  X(25)  VALUE  '0190301903019030190300000'.
         02 FILLER     PIC  X(25)  VALUE  '0205602056020560205600000'.
         02 FILLER     PIC  X(25)  VALUE  '0221302213022130221300000'.
         02 FILLER     PIC  X(25)  VALUE  '0239802398023980239800000'.
55       02 FILLER     PIC  X(25)  VALUE  '0262102621026210262100000'.
         02 FILLER     PIC  X(25)  VALUE  '0288802888028880288800000'.
         02 FILLER     PIC  X(25)  VALUE  '0320703207032070320700000'.
         02 FILLER     PIC  X(25)  VALUE  '0356803568035680356800000'.
         02 FILLER     PIC  X(25)  VALUE  '0397903979039790397900000'.
60       02 FILLER     PIC  X(25)  VALUE  '0458104581045810458100000'.
         02 FILLER     PIC  X(25)  VALUE  '0508105081050810508100000'.
         02 FILLER     PIC  X(25)  VALUE  '0562105621056210562100000'.
         02 FILLER     PIC  X(25)  VALUE  '0619306193061930619300000'.
         02 FILLER     PIC  X(25)  VALUE  '0679006790067900679000000'.
65       02 FILLER     PIC  X(25)  VALUE  '0739907399073990739900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *------------(  3 HOI  NOJEOK  WOMAN  RISK  LYO )--------------*
15       02 FILLER     PIC  X(25)  VALUE  '0015300153001530015300000'.
         02 FILLER     PIC  X(25)  VALUE  '0015700157001570015700000'.
         02 FILLER     PIC  X(25)  VALUE  '0015900159001590015900000'.
         02 FILLER     PIC  X(25)  VALUE  '0015700157001570015700000'.
         02 FILLER     PIC  X(25)  VALUE  '0015500155001550015500000'.
20       02 FILLER     PIC  X(25)  VALUE  '0019200192001920019200000'.
         02 FILLER     PIC  X(25)  VALUE  '0019900199001990019900000'.
         02 FILLER     PIC  X(25)  VALUE  '0020700207002070020700000'.
         02 FILLER     PIC  X(25)  VALUE  '0021600216002160021600000'.
         02 FILLER     PIC  X(25)  VALUE  '0022300223002230022300000'.
25       02 FILLER     PIC  X(25)  VALUE  '0022800228002280022800000'.
         02 FILLER     PIC  X(25)  VALUE  '0023000230002300023000000'.
         02 FILLER     PIC  X(25)  VALUE  '0023400234002340023400000'.
         02 FILLER     PIC  X(25)  VALUE  '0023900239002390023900000'.
         02 FILLER     PIC  X(25)  VALUE  '0024600246002460024600000'.
30       02 FILLER     PIC  X(25)  VALUE  '0026400264002640026400000'.
         02 FILLER     PIC  X(25)  VALUE  '0027100271002710027100000'.
         02 FILLER     PIC  X(25)  VALUE  '0027700277002770027700000'.
         02 FILLER     PIC  X(25)  VALUE  '0028600286002860028600000'.
         02 FILLER     PIC  X(25)  VALUE  '0029500295002950029500000'.
35       02 FILLER     PIC  X(25)  VALUE  '0030500305003050030500000'.
         02 FILLER     PIC  X(25)  VALUE  '0031700317003170031700000'.
         02 FILLER     PIC  X(25)  VALUE  '0032500325003250032500000'.
         02 FILLER     PIC  X(25)  VALUE  '0033600336003360033600000'.
         02 FILLER     PIC  X(25)  VALUE  '0034800348003480034800000'.
40       02 FILLER     PIC  X(25)  VALUE  '0038000380003800038000000'.
         02 FILLER     PIC  X(25)  VALUE  '0039400394003940039400000'.
         02 FILLER     PIC  X(25)  VALUE  '0041300413004130041300000'.
         02 FILLER     PIC  X(25)  VALUE  '0043400434004340043400000'.
         02 FILLER     PIC  X(25)  VALUE  '0046200462004620046200000'.
45       02 FILLER     PIC  X(25)  VALUE  '0049200492004920049200000'.
         02 FILLER     PIC  X(25)  VALUE  '0052600526005260052600000'.
         02 FILLER     PIC  X(25)  VALUE  '0055800558005580055800000'.
         02 FILLER     PIC  X(25)  VALUE  '0058700587005870058700000'.
         02 FILLER     PIC  X(25)  VALUE  '0062100621006210062100000'.
50       02 FILLER     PIC  X(25)  VALUE  '0069600696006960069600000'.
         02 FILLER     PIC  X(25)  VALUE  '0074500745007450074500000'.
         02 FILLER     PIC  X(25)  VALUE  '0079800798007980079800000'.
         02 FILLER     PIC  X(25)  VALUE  '0086100861008610086100000'.
         02 FILLER     PIC  X(25)  VALUE  '0092600926009260092600000'.
55       02 FILLER     PIC  X(25)  VALUE  '0100201002010020100200000'.
         02 FILLER     PIC  X(25)  VALUE  '0109501095010950109500000'.
         02 FILLER     PIC  X(25)  VALUE  '0121601216012160121600000'.
         02 FILLER     PIC  X(25)  VALUE  '0136001360013600136000000'.
         02 FILLER     PIC  X(25)  VALUE  '0151601516015160151600000'.
60       02 FILLER     PIC  X(25)  VALUE  '0178301783017830178300000'.
         02 FILLER     PIC  X(25)  VALUE  '0195901959019590195900000'.
         02 FILLER     PIC  X(25)  VALUE  '0213702137021370213700000'.
         02 FILLER     PIC  X(25)  VALUE  '0233202332023320233200000'.
         02 FILLER     PIC  X(25)  VALUE  '0255002550025500255000000'.
65       02 FILLER     PIC  X(25)  VALUE  '0279002790027900279000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *------------(  3 HOI  NON-TAX  MAN  RISK  LYO )---------------*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000037800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000038700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000039400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000040400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000042400000'.
20       02 FILLER     PIC  X(25)  VALUE  '0000000000000000086400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000089300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000092700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000094800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000096000000'.
25       02 FILLER     PIC  X(25)  VALUE  '0000000000000000095600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000094200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000092800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000091400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000090600000'.
30       02 FILLER     PIC  X(25)  VALUE  '0000000000000000080700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000081000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000081600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000082900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000084400000'.
35       02 FILLER     PIC  X(25)  VALUE  '0000000000000000086600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000089100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000091400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000094500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000098200000'.
40       02 FILLER     PIC  X(25)  VALUE  '0000000000000000112900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000117700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000123200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000128100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000134900000'.
45       02 FILLER     PIC  X(25)  VALUE  '0000000000000000142700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000151000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000161000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000171600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000183300000'.
50       02 FILLER     PIC  X(25)  VALUE  '0000000000000000214400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000229300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000243600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000259500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000277900000'.
55       02 FILLER     PIC  X(25)  VALUE  '0000000000000000300000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000327200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000359100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000395700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000436900000'.
60       02 FILLER     PIC  X(25)  VALUE  '0000000000000000508000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000558500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000612100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000668500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000728200000'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000790000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000855100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000921300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000994600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000001072700000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000001159500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *--(  3 HOI  NON-TAX,NON-UDAEJEOCHUK WOMAN  RISK  LYO )---*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000018600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000018900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000019100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000019000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000018800000'.
20       02 FILLER     PIC  X(25)  VALUE  '0000000000000000025400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000026000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000026900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000027900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000028600000'.
25       02 FILLER     PIC  X(25)  VALUE  '0000000000000000029100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000029600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000030000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000030500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000031200000'.
30       02 FILLER     PIC  X(25)  VALUE  '0000000000000000033800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000034500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000035200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000036100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000037100000'.
35       02 FILLER     PIC  X(25)  VALUE  '0000000000000000038100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000039400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000040400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000040800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000042000000'.
40       02 FILLER     PIC  X(25)  VALUE  '0000000000000000048200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000049600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000051500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000053800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000056500000'.
45       02 FILLER     PIC  X(25)  VALUE  '0000000000000000059500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000062800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000066000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000069100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000072600000'.
50       02 FILLER     PIC  X(25)  VALUE  '0000000000000000085100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000090100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000095300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000101600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000108200000'.
55       02 FILLER     PIC  X(25)  VALUE  '0000000000000000115300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000124900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000137000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000151700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000167600000'.
60       02 FILLER     PIC  X(25)  VALUE  '0000000000000000204000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000221300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000239100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000258600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000280600000'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000304700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000331100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000360600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000392800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000429100000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000469200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *----- ３회　직장인우대설계　위험보험료　남자     ------*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000008'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000008'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000009'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000009'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000010'.
20       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000012'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000014'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000016'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000017'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000018'.
25       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000018'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000017'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000016'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000015'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000015'.
30       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000014'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000015'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000015'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000016'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000017'.
35       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000018'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000019'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000021'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000023'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000025'.
40       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000027'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000030'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000033'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000036'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000040'.
45       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000044'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000049'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000055'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000061'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000068'.
50       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000075'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000083'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000092'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000101'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000112'.
55       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000125'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000140'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000158'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000179'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000202'.
60       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000229'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000257'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000288'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000320'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000353'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000388'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000424'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000461'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *------　３회　직장인　우대설계　여자　위험보험료　----------*  00
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000003'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000003'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000004'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000004'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000003'.
20       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000004'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000004'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000004'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000005'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000005'.
25       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000006'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000006'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000006'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000006'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000007'.
30       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000007'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000007'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000008'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000008'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000009'.
35       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000009'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000010'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000011'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000011'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000012'.
40       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000013'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000014'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000015'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000016'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000018'.
45       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000019'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000021'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000023'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000025'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000027'.
50       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000029'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000032'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000035'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000039'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000042'.
55       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000047'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000052'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000059'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000067'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000076'.
60       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000086'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000096'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000106'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000117'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000130'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000144'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000159'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000176'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *-------------(3 HOI-971001 NOBOK MAN RISK  LYO )--------------*
15       02 FILLER     PIC  X(25)  VALUE  '0028800304003210033700009'.
         02 FILLER     PIC  X(25)  VALUE  '0029400313003310035000010'.
         02 FILLER     PIC  X(25)  VALUE  '0029900319003390036000010'.
         02 FILLER     PIC  X(25)  VALUE  '0030600329003520037400011'.
         02 FILLER     PIC  X(25)  VALUE  '0032100349003770040400012'.
20       02 FILLER     PIC  X(25)  VALUE  '0055800562005670057100014'.
         02 FILLER     PIC  X(25)  VALUE  '0058400597006100062400016'.
         02 FILLER     PIC  X(25)  VALUE  '0060800629006500067100018'.
         02 FILLER     PIC  X(25)  VALUE  '0062400650006770070400019'.
         02 FILLER     PIC  X(25)  VALUE  '0063100660006900071900019'.
25       02 FILLER     PIC  X(25)  VALUE  '0062900657006850071400019'.
         02 FILLER     PIC  X(25)  VALUE  '0062100647006730069900019'.
         02 FILLER     PIC  X(25)  VALUE  '0061000632006540067600018'.
         02 FILLER     PIC  X(25)  VALUE  '0059900617006350065400017'.
         02 FILLER     PIC  X(25)  VALUE  '0059100607006230063900016'.
30       02 FILLER     PIC  X(25)  VALUE  '0053200555005770060000016'.
         02 FILLER     PIC  X(25)  VALUE  '0053300556005790060200016'.
         02 FILLER     PIC  X(25)  VALUE  '0053800563005870061200016'.
         02 FILLER     PIC  X(25)  VALUE  '0054700575006020063000017'.
         02 FILLER     PIC  X(25)  VALUE  '0055900591006230065400018'.
35       02 FILLER     PIC  X(25)  VALUE  '0057400611006480068400019'.
         02 FILLER     PIC  X(25)  VALUE  '0059300636006790072200021'.
         02 FILLER     PIC  X(25)  VALUE  '0061400664007140076400022'.
         02 FILLER     PIC  X(25)  VALUE  '0063700694007520080900024'.
         02 FILLER     PIC  X(25)  VALUE  '0066300729007960086200026'.
40       02 FILLER     PIC  X(25)  VALUE  '0075600823008900095700028'.
         02 FILLER     PIC  X(25)  VALUE  '0079100870009480102700031'.
         02 FILLER     PIC  X(25)  VALUE  '0083000921010130110500034'.
         02 FILLER     PIC  X(25)  VALUE  '0087200978010840119000037'.
         02 FILLER     PIC  X(25)  VALUE  '0092101043011650128700041'.
45       02 FILLER     PIC  X(25)  VALUE  '0097701118012590140000046'.
         02 FILLER     PIC  X(25)  VALUE  '0104201205013670153000051'.
         02 FILLER     PIC  X(25)  VALUE  '0111501302014890167500056'.
         02 FILLER     PIC  X(25)  VALUE  '0119401407016200183300062'.
         02 FILLER     PIC  X(25)  VALUE  '0128401527017700201400069'.
50       02 FILLER     PIC  X(25)  VALUE  '0150401763020210228000077'.
         02 FILLER     PIC  X(25)  VALUE  '0161101905021990249400085'.
         02 FILLER     PIC  X(25)  VALUE  '0172402056023880272000094'.
         02 FILLER     PIC  X(25)  VALUE  '0184202213025850295600103'.
         02 FILLER     PIC  X(25)  VALUE  '0198102398028160323300113'.
55       02 FILLER     PIC  X(25)  VALUE  '0214702620030930356600126'.
         02 FILLER     PIC  X(25)  VALUE  '0234802888034270396700141'.
         02 FILLER     PIC  X(25)  VALUE  '0258703206038250444400160'.
         02 FILLER     PIC  X(25)  VALUE  '0285803567042770498600180'.
         02 FILLER     PIC  X(25)  VALUE  '0316803980047930560500204'.
60       02 FILLER     PIC  X(25)  VALUE  '0367704583054900639600239'.
         02 FILLER     PIC  X(25)  VALUE  '0405205083061140714600259'.
         02 FILLER     PIC  X(25)  VALUE  '0445505620067860795100289'.
         02 FILLER     PIC  X(25)  VALUE  '0488506193075010881000321'.
         02 FILLER     PIC  X(25)  VALUE  '0533306790082470970400355'.
65       02 FILLER     PIC  X(25)  VALUE  '0579207401090111062000389'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *----------(3 HOI-971001 NOBOK  WOMAN  RISK  LYO )------------*
15       02 FILLER     PIC  X(25)  VALUE  '0014500154001630017200005'.
         02 FILLER     PIC  X(25)  VALUE  '0014700157001670017700005'.
         02 FILLER     PIC  X(25)  VALUE  '0014800159001690017900005'.
         02 FILLER     PIC  X(25)  VALUE  '0014700157001670017700005'.
         02 FILLER     PIC  X(25)  VALUE  '0014600155001650017400005'.
20       02 FILLER     PIC  X(25)  VALUE  '0018600191001950019900005'.
         02 FILLER     PIC  X(25)  VALUE  '0019100197002030020900005'.
         02 FILLER     PIC  X(25)  VALUE  '0019800205002130022100006'.
         02 FILLER     PIC  X(25)  VALUE  '0020500215002260023600006'.
         02 FILLER     PIC  X(25)  VALUE  '0021000222002340024600007'.
25       02 FILLER     PIC  X(25)  VALUE  '0021400227002400025400007'.
         02 FILLER     PIC  X(25)  VALUE  '0021700232002470026100007'.
         02 FILLER     PIC  X(25)  VALUE  '0022000235002510026600008'.
         02 FILLER     PIC  X(25)  VALUE  '0022400240002570027400008'.
         02 FILLER     PIC  X(25)  VALUE  '0022900247002650028400008'.
30       02 FILLER     PIC  X(25)  VALUE  '0024500263002810029800009'.
         02 FILLER     PIC  X(25)  VALUE  '0025000269002890030800009'.
         02 FILLER     PIC  X(25)  VALUE  '0025500276002970031800009'.
         02 FILLER     PIC  X(25)  VALUE  '0026100284003080033100010'.
         02 FILLER     PIC  X(25)  VALUE  '0026900294003200034600010'.
35       02 FILLER     PIC  X(25)  VALUE  '0027600304003330036100011'.
         02 FILLER     PIC  X(25)  VALUE  '0028500316003470037800012'.
         02 FILLER     PIC  X(25)  VALUE  '0029200326003600039300012'.
         02 FILLER     PIC  X(25)  VALUE  '0030100338003740041100013'.
         02 FILLER     PIC  X(25)  VALUE  '0031000349003890042800014'.
40       02 FILLER     PIC  X(25)  VALUE  '0034100380004200046000014'.
         02 FILLER     PIC  X(25)  VALUE  '0035200395004390048200015'.
         02 FILLER     PIC  X(25)  VALUE  '0036600414004620051000016'.
         02 FILLER     PIC  X(25)  VALUE  '0038200435004890054200018'.
         02 FILLER     PIC  X(25)  VALUE  '0040200462005220058200019'.
45       02 FILLER     PIC  X(25)  VALUE  '0042400492005600062700021'.
         02 FILLER     PIC  X(25)  VALUE  '0044900525006010067700023'.
         02 FILLER     PIC  X(25)  VALUE  '0047300557006410072400025'.
         02 FILLER     PIC  X(25)  VALUE  '0049500587006780076900026'.
         02 FILLER     PIC  X(25)  VALUE  '0052000620007200081900028'.
50       02 FILLER     PIC  X(25)  VALUE  '0059300697008010090500031'.
         02 FILLER     PIC  X(25)  VALUE  '0062900745008610097800033'.
         02 FILLER     PIC  X(25)  VALUE  '0066900799009280105800037'.
         02 FILLER     PIC  X(25)  VALUE  '0071500860010050115000040'.
         02 FILLER     PIC  X(25)  VALUE  '0076400925010860124800044'.
55       02 FILLER     PIC  X(25)  VALUE  '0082201002011820136300048'.
         02 FILLER     PIC  X(25)  VALUE  '0089201095012990150300054'.
         02 FILLER     PIC  X(25)  VALUE  '0098201216014490168300061'.
         02 FILLER     PIC  X(25)  VALUE  '0109001359016290189900069'.
         02 FILLER     PIC  X(25)  VALUE  '0120801517018260213500078'.
60       02 FILLER     PIC  X(25)  VALUE  '0145101783021150244700087'.
         02 FILLER     PIC  X(25)  VALUE  '0158301959023350271100098'.
         02 FILLER     PIC  X(25)  VALUE  '0171602137025570297800108'.
         02 FILLER     PIC  X(25)  VALUE  '0186402333028030327200119'.
         02 FILLER     PIC  X(25)  VALUE  '0202602550030740359700132'.
65       02 FILLER     PIC  X(25)  VALUE  '0220702791033740395800145'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *----------(3 HOI-980113 슈퍼재태크　남자PR  )------------*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000027000010'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000027400010'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000027800011'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000028300011'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000029300012'.
20       02 FILLER     PIC  X(25)  VALUE  '0000000000000000055200014'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000057000016'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000058700018'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000059800019'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000060400020'.
25       02 FILLER     PIC  X(25)  VALUE  '0000000000000000060000020'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000059500019'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000058900018'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000058200017'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000057800017'.
30       02 FILLER     PIC  X(25)  VALUE  '0000000000000000051200016'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000051300017'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000051700017'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000052000018'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000052900019'.
35       02 FILLER     PIC  X(25)  VALUE  '0000000000000000054000020'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000055300021'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000056300023'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000057900025'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000059400027'.
40       02 FILLER     PIC  X(25)  VALUE  '0000000000000000068800029'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000070900032'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000073600035'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000076600038'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000079700042'.
45       02 FILLER     PIC  X(25)  VALUE  '0000000000000000083700046'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000087900051'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000093000056'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000098100062'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000104100069'.
50       02 FILLER     PIC  X(25)  VALUE  '0000000000000000124400076'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000131700085'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000138900093'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000147000102'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000156200113'.
55       02 FILLER     PIC  X(25)  VALUE  '0000000000000000167600126'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000181000141'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000197000159'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000214900180'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000235400203'.
60       02 FILLER     PIC  X(25)  VALUE  '0000000000000000277200230'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000302500258'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000328900289'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000357700321'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000387400355'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000418100389'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000451500426'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000484100463'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000520900503'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000559800547'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000602900594'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *----------(3 HOI-980113 슈퍼재태크　여자PR  )------------*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000013500005'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000013600005'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000013700006'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000013600005'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000013600005'.
20       02 FILLER     PIC  X(25)  VALUE  '0000000000000000018300005'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000018600006'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000019100006'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000019600007'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000019900007'.
25       02 FILLER     PIC  X(25)  VALUE  '0000000000000000020200008'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000020400008'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000020600008'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000020900008'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000021200009'.
30       02 FILLER     PIC  X(25)  VALUE  '0000000000000000022800009'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000023100009'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000023500010'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000023900010'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000024400011'.
35       02 FILLER     PIC  X(25)  VALUE  '0000000000000000025000011'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000025600012'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000026100013'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000026600013'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000027300014'.
40       02 FILLER     PIC  X(25)  VALUE  '0000000000000000030300015'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000031100016'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000032000017'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000033200018'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000034200020'.
45       02 FILLER     PIC  X(25)  VALUE  '0000000000000000035700021'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000037400023'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000039000025'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000040600027'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000041900029'.
50       02 FILLER     PIC  X(25)  VALUE  '0000000000000000048800031'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000051000034'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000053700037'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000056900041'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000060200044'.
55       02 FILLER     PIC  X(25)  VALUE  '0000000000000000064200049'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000068700054'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000074700060'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000082100068'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000090100078'.
60       02 FILLER     PIC  X(25)  VALUE  '0000000000000000111900087'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000121100097'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000129500107'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000139400119'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000150300131'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000162500145'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000175600160'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000190000177'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000206700196'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000224600216'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000245100239'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *----------(3 HOI-980211 슈퍼재태크II 남자PR  )------------*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000009'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000010'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000010'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000011'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000012'.
20       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000014'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000016'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000018'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000019'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000019'.
25       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000019'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000019'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000018'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000017'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000016'.
30       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000016'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000016'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000016'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000017'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000018'.
35       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000019'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000021'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000022'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000024'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000026'.
40       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000028'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000031'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000034'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000037'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000041'.
45       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000046'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000051'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000056'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000062'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000069'.
50       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000077'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000085'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000094'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000103'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000113'.
55       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000126'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000141'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000160'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000180'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000204'.
60       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000230'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000259'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000289'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000321'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000355'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000389'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000426'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000463'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000503'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000546'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000593'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000645'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000700'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000760'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000824'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000894'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000970'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001051'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001139'.
      *  02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001234'.
80    *  02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001336'.
      *  02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001446'.
      *  02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001564'.
      *  02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001691'.
      *  02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001826'.
85    *  02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001971'.
      *----------(3 HOI-980113 슈퍼재태크II 여자  )------------*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000005'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000005'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000005'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000005'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000005'.
20       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000005'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000005'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000006'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000006'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000007'.
25       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000007'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000007'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000008'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000008'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000008'.
30       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000009'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000009'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000009'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000010'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000010'.
35       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000011'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000012'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000012'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000013'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000014'.
40       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000014'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000015'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000016'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000018'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000019'.
45       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000021'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000023'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000025'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000026'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000028'.
50       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000031'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000033'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000037'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000040'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000044'.
55       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000048'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000054'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000061'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000069'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000078'.
60       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000087'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000098'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000108'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000119'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000131'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000145'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000160'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000177'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000196'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000216'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000239'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000264'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000292'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000322'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000356'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000393'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000434'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000479'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000528'.
      *  02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000583'.
80    *  02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000643'.
      *  02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000709'.
      *  02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000781'.
      *  02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000861'.
      *  02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000948'.
85    *  02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001043'.
      *--------  거치전환　남자　１００만원당위험보험료　--------
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000094'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000098'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000102'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000108'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000120'.
20       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000137'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000157'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000176'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000188'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000194'.
25       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000192'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000186'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000178'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000169'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000163'.
30       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000160'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000161'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000165'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000172'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000181'.
35       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000193'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000207'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000224'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000241'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000261'.
40       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000285'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000312'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000341'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000374'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000412'.
45       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000455'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000505'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000561'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000622'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000692'.
50       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000768'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000850'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000937'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001027'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001133'.
55       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001261'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001414'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001596'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001803'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000002038'.
60       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000002304'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000002588'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000002892'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000003215'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000003550'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000003893'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000004258'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000004628'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *--------　거치전환　여자위험보험료　１００만원당　-------*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000048'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000050'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000051'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000050'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000049'.
20       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000050'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000054'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000059'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000065'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000069'.
25       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000071'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000074'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000076'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000079'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000083'.
30       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000086'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000090'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000094'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000098'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000104'.
35       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000110'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000117'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000123'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000129'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000136'.
40       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000144'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000152'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000163'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000176'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000191'.
45       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000208'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000228'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000246'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000263'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000283'.
50       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000307'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000335'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000366'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000401'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000439'.
55       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000483'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000537'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000607'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000690'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000780'.
60       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000874'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000975'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001077'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001190'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001315'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001453'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001605'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001773'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000001959'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000002164'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000002391'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000002641'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000002918'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000003222'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000003558'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *----------------　뉴재테크　남자위험보험료　---------------*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000027000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000027400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000027800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000028300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000029300000'.
20       02 FILLER     PIC  X(25)  VALUE  '0000000000000000055200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000057000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000058700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000059800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000060400000'.
25       02 FILLER     PIC  X(25)  VALUE  '0000000000000000060000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000059500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000058900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000058200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000057800000'.
30       02 FILLER     PIC  X(25)  VALUE  '0000000000000000051200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000051300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000051700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000052000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000052900000'.
35       02 FILLER     PIC  X(25)  VALUE  '0000000000000000054000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000055300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000056300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000057900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000059400000'.
40       02 FILLER     PIC  X(25)  VALUE  '0000000000000000068800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000070900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000073600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000076600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000079700000'.
45       02 FILLER     PIC  X(25)  VALUE  '0000000000000000083700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000087900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000093000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000098100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000104100000'.
50       02 FILLER     PIC  X(25)  VALUE  '0000000000000000124400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000131700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000138900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000147000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000156200000'.
55       02 FILLER     PIC  X(25)  VALUE  '0000000000000000167600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000181000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000197000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000214900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000235400000'.
60       02 FILLER     PIC  X(25)  VALUE  '0000000000000000277200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000302500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000328900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000357700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000387400000'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000418100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000451500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000484100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000520900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000559800000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000602900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
      *----------------　뉴재테크　여자위험보험료　---------------*
15       02 FILLER     PIC  X(25)  VALUE  '0000000000000000013500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000013600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000013700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000013600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000013600000'.
20       02 FILLER     PIC  X(25)  VALUE  '0000000000000000018300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000018600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000019100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000019600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000019900000'.
25       02 FILLER     PIC  X(25)  VALUE  '0000000000000000020200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000020400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000020600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000020900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000021200000'.
30       02 FILLER     PIC  X(25)  VALUE  '0000000000000000022800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000023100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000023500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000023900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000024400000'.
35       02 FILLER     PIC  X(25)  VALUE  '0000000000000000025000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000025600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000026100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000026600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000027300000'.
40       02 FILLER     PIC  X(25)  VALUE  '0000000000000000030300000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000031100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000032000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000033200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000034200000'.
45       02 FILLER     PIC  X(25)  VALUE  '0000000000000000035700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000037400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000039000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000040600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000041900000'.
50       02 FILLER     PIC  X(25)  VALUE  '0000000000000000048800000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000051000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000053700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000056900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000060200000'.
55       02 FILLER     PIC  X(25)  VALUE  '0000000000000000064200000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000068700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000074700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000082100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000090100000'.
60       02 FILLER     PIC  X(25)  VALUE  '0000000000000000111900000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000121100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000129500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000139400000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000150300000'.
65       02 FILLER     PIC  X(25)  VALUE  '0000000000000000162500000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000175600000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000190000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000206700000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000224600000'.
70       02 FILLER     PIC  X(25)  VALUE  '0000000000000000245100000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
75       02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.
         02 FILLER     PIC  X(25)  VALUE  '0000000000000000000000000'.

      *=========  예정이율　６．５％인하에　따른　적용================

      *-------뉴재테크 남자 예정이율6.5%---------*
 15       02 FILLER  PIC  X(25)  VALUE '0000000000000000027000000'.
 16       02 FILLER  PIC  X(25)  VALUE '0000000000000000027400000'.
 17       02 FILLER  PIC  X(25)  VALUE '0000000000000000027800000'.
 18       02 FILLER  PIC  X(25)  VALUE '0000000000000000028300000'.
 19       02 FILLER  PIC  X(25)  VALUE '0000000000000000029400000'.
 20       02 FILLER  PIC  X(25)  VALUE '0000000000000000055200000'.
 21       02 FILLER  PIC  X(25)  VALUE '0000000000000000057000000'.
 22       02 FILLER  PIC  X(25)  VALUE '0000000000000000058700000'.
 23       02 FILLER  PIC  X(25)  VALUE '0000000000000000059800000'.
 24       02 FILLER  PIC  X(25)  VALUE '0000000000000000060400000'.
 25       02 FILLER  PIC  X(25)  VALUE '0000000000000000060000000'.
 26       02 FILLER  PIC  X(25)  VALUE '0000000000000000059600000'.
 27       02 FILLER  PIC  X(25)  VALUE '0000000000000000058900000'.
 28       02 FILLER  PIC  X(25)  VALUE '0000000000000000058200000'.
 29       02 FILLER  PIC  X(25)  VALUE '0000000000000000057800000'.
 30       02 FILLER  PIC  X(25)  VALUE '0000000000000000051200000'.
 31       02 FILLER  PIC  X(25)  VALUE '0000000000000000051400000'.
 32       02 FILLER  PIC  X(25)  VALUE '0000000000000000051700000'.
 33       02 FILLER  PIC  X(25)  VALUE '0000000000000000052000000'.
 34       02 FILLER  PIC  X(25)  VALUE '0000000000000000052900000'.
 35       02 FILLER  PIC  X(25)  VALUE '0000000000000000054000000'.
 36       02 FILLER  PIC  X(25)  VALUE '0000000000000000055300000'.
 37       02 FILLER  PIC  X(25)  VALUE '0000000000000000056400000'.
 38       02 FILLER  PIC  X(25)  VALUE '0000000000000000058000000'.
 39       02 FILLER  PIC  X(25)  VALUE '0000000000000000059500000'.
 40       02 FILLER  PIC  X(25)  VALUE '0000000000000000068800000'.
 41       02 FILLER  PIC  X(25)  VALUE '0000000000000000070900000'.
 42       02 FILLER  PIC  X(25)  VALUE '0000000000000000073700000'.
 43       02 FILLER  PIC  X(25)  VALUE '0000000000000000076600000'.
 44       02 FILLER  PIC  X(25)  VALUE '0000000000000000079800000'.
 45       02 FILLER  PIC  X(25)  VALUE '0000000000000000083700000'.
 46       02 FILLER  PIC  X(25)  VALUE '0000000000000000087900000'.
 47       02 FILLER  PIC  X(25)  VALUE '0000000000000000093000000'.
 48       02 FILLER  PIC  X(25)  VALUE '0000000000000000098100000'.
 49       02 FILLER  PIC  X(25)  VALUE '0000000000000000104100000'.
 50       02 FILLER  PIC  X(25)  VALUE '0000000000000000124500000'.
 51       02 FILLER  PIC  X(25)  VALUE '0000000000000000131800000'.
 52       02 FILLER  PIC  X(25)  VALUE '0000000000000000139000000'.
 53       02 FILLER  PIC  X(25)  VALUE '0000000000000000147100000'.
 54       02 FILLER  PIC  X(25)  VALUE '0000000000000000156300000'.
 55       02 FILLER  PIC  X(25)  VALUE '0000000000000000167700000'.
 56       02 FILLER  PIC  X(25)  VALUE '0000000000000000181100000'.
 57       02 FILLER  PIC  X(25)  VALUE '0000000000000000197100000'.
 58       02 FILLER  PIC  X(25)  VALUE '0000000000000000215000000'.
 59       02 FILLER  PIC  X(25)  VALUE '0000000000000000235500000'.
 60       02 FILLER  PIC  X(25)  VALUE '0000000000000000277400000'.
 61       02 FILLER  PIC  X(25)  VALUE '0000000000000000302700000'.
 62       02 FILLER  PIC  X(25)  VALUE '0000000000000000329100000'.
 63       02 FILLER  PIC  X(25)  VALUE '0000000000000000357900000'.
 64       02 FILLER  PIC  X(25)  VALUE '0000000000000000387600000'.
 65       02 FILLER  PIC  X(25)  VALUE '0000000000000000418300000'.
 66       02 FILLER  PIC  X(25)  VALUE '0000000000000000451800000'.
 67       02 FILLER  PIC  X(25)  VALUE '0000000000000000484400000'.
 68       02 FILLER  PIC  X(25)  VALUE '0000000000000000521200000'.
 69       02 FILLER  PIC  X(25)  VALUE '0000000000000000560200000'.
 70       02 FILLER  PIC  X(25)  VALUE '0000000000000000603300000'.
 71       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 72       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 73       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 74       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 75       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 76       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 77       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 78       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.

      *-------뉴재테크 여자 예정이율6.5%---------*
 15       02 FILLER  PIC  X(25)  VALUE '0000000000000000013500000'.
 16       02 FILLER  PIC  X(25)  VALUE '0000000000000000013600000'.
 17       02 FILLER  PIC  X(25)  VALUE '0000000000000000013700000'.
 18       02 FILLER  PIC  X(25)  VALUE '0000000000000000013600000'.
 19       02 FILLER  PIC  X(25)  VALUE '0000000000000000013600000'.
 20       02 FILLER  PIC  X(25)  VALUE '0000000000000000018300000'.
 21       02 FILLER  PIC  X(25)  VALUE '0000000000000000018700000'.
 22       02 FILLER  PIC  X(25)  VALUE '0000000000000000019100000'.
 23       02 FILLER  PIC  X(25)  VALUE '0000000000000000019600000'.
 24       02 FILLER  PIC  X(25)  VALUE '0000000000000000019900000'.
 25       02 FILLER  PIC  X(25)  VALUE '0000000000000000020200000'.
 26       02 FILLER  PIC  X(25)  VALUE '0000000000000000020500000'.
 27       02 FILLER  PIC  X(25)  VALUE '0000000000000000020600000'.
 28       02 FILLER  PIC  X(25)  VALUE '0000000000000000020900000'.
 29       02 FILLER  PIC  X(25)  VALUE '0000000000000000021200000'.
 30       02 FILLER  PIC  X(25)  VALUE '0000000000000000022800000'.
 31       02 FILLER  PIC  X(25)  VALUE '0000000000000000023100000'.
 32       02 FILLER  PIC  X(25)  VALUE '0000000000000000023500000'.
 33       02 FILLER  PIC  X(25)  VALUE '0000000000000000023900000'.
 34       02 FILLER  PIC  X(25)  VALUE '0000000000000000024400000'.
 35       02 FILLER  PIC  X(25)  VALUE '0000000000000000025000000'.
 36       02 FILLER  PIC  X(25)  VALUE '0000000000000000025600000'.
 37       02 FILLER  PIC  X(25)  VALUE '0000000000000000026100000'.
 38       02 FILLER  PIC  X(25)  VALUE '0000000000000000026600000'.
 39       02 FILLER  PIC  X(25)  VALUE '0000000000000000027300000'.
 40       02 FILLER  PIC  X(25)  VALUE '0000000000000000030400000'.
 41       02 FILLER  PIC  X(25)  VALUE '0000000000000000031100000'.
 42       02 FILLER  PIC  X(25)  VALUE '0000000000000000032000000'.
 43       02 FILLER  PIC  X(25)  VALUE '0000000000000000033200000'.
 44       02 FILLER  PIC  X(25)  VALUE '0000000000000000034200000'.
 45       02 FILLER  PIC  X(25)  VALUE '0000000000000000035700000'.
 46       02 FILLER  PIC  X(25)  VALUE '0000000000000000037400000'.
 47       02 FILLER  PIC  X(25)  VALUE '0000000000000000039000000'.
 48       02 FILLER  PIC  X(25)  VALUE '0000000000000000040600000'.
 49       02 FILLER  PIC  X(25)  VALUE '0000000000000000041900000'.
 50       02 FILLER  PIC  X(25)  VALUE '0000000000000000048800000'.
 51       02 FILLER  PIC  X(25)  VALUE '0000000000000000051000000'.
 52       02 FILLER  PIC  X(25)  VALUE '0000000000000000053800000'.
 53       02 FILLER  PIC  X(25)  VALUE '0000000000000000056900000'.
 54       02 FILLER  PIC  X(25)  VALUE '0000000000000000060200000'.
 55       02 FILLER  PIC  X(25)  VALUE '0000000000000000064200000'.
 56       02 FILLER  PIC  X(25)  VALUE '0000000000000000068700000'.
 57       02 FILLER  PIC  X(25)  VALUE '0000000000000000074800000'.
 58       02 FILLER  PIC  X(25)  VALUE '0000000000000000082200000'.
 59       02 FILLER  PIC  X(25)  VALUE '0000000000000000090200000'.
 60       02 FILLER  PIC  X(25)  VALUE '0000000000000000111900000'.
 61       02 FILLER  PIC  X(25)  VALUE '0000000000000000121200000'.
 62       02 FILLER  PIC  X(25)  VALUE '0000000000000000129600000'.
 63       02 FILLER  PIC  X(25)  VALUE '0000000000000000139400000'.
 64       02 FILLER  PIC  X(25)  VALUE '0000000000000000150400000'.
 65       02 FILLER  PIC  X(25)  VALUE '0000000000000000162500000'.
 66       02 FILLER  PIC  X(25)  VALUE '0000000000000000175700000'.
 67       02 FILLER  PIC  X(25)  VALUE '0000000000000000190100000'.
 68       02 FILLER  PIC  X(25)  VALUE '0000000000000000206800000'.
 69       02 FILLER  PIC  X(25)  VALUE '0000000000000000224800000'.
 70       02 FILLER  PIC  X(25)  VALUE '0000000000000000245200000'.
 71       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 72       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 73       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 74       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 75       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 76       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 77       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 78       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.

      *-------슈퍼재테크          남자 예정이율6.5%---------*
 15       02 FILLER  PIC  X(25)  VALUE '0000000000000000027000010'.
 16       02 FILLER  PIC  X(25)  VALUE '0000000000000000027400010'.
 17       02 FILLER  PIC  X(25)  VALUE '0000000000000000027800011'.
 18       02 FILLER  PIC  X(25)  VALUE '0000000000000000028300011'.
 19       02 FILLER  PIC  X(25)  VALUE '0000000000000000029400012'.
 20       02 FILLER  PIC  X(25)  VALUE '0000000000000000055200014'.
 21       02 FILLER  PIC  X(25)  VALUE '0000000000000000057000016'.
 22       02 FILLER  PIC  X(25)  VALUE '0000000000000000058700018'.
 23       02 FILLER  PIC  X(25)  VALUE '0000000000000000059800019'.
 24       02 FILLER  PIC  X(25)  VALUE '0000000000000000060400020'.
 25       02 FILLER  PIC  X(25)  VALUE '0000000000000000060000020'.
 26       02 FILLER  PIC  X(25)  VALUE '0000000000000000059600019'.
 27       02 FILLER  PIC  X(25)  VALUE '0000000000000000058900018'.
 28       02 FILLER  PIC  X(25)  VALUE '0000000000000000058200017'.
 29       02 FILLER  PIC  X(25)  VALUE '0000000000000000057800017'.
 30       02 FILLER  PIC  X(25)  VALUE '0000000000000000051200017'.
 31       02 FILLER  PIC  X(25)  VALUE '0000000000000000051400017'.
 32       02 FILLER  PIC  X(25)  VALUE '0000000000000000051700017'.
 33       02 FILLER  PIC  X(25)  VALUE '0000000000000000052000018'.
 34       02 FILLER  PIC  X(25)  VALUE '0000000000000000052900019'.
 35       02 FILLER  PIC  X(25)  VALUE '0000000000000000054000020'.
 36       02 FILLER  PIC  X(25)  VALUE '0000000000000000055300021'.
 37       02 FILLER  PIC  X(25)  VALUE '0000000000000000056400023'.
 38       02 FILLER  PIC  X(25)  VALUE '0000000000000000058000025'.
 39       02 FILLER  PIC  X(25)  VALUE '0000000000000000059500027'.
 40       02 FILLER  PIC  X(25)  VALUE '0000000000000000068800029'.
 41       02 FILLER  PIC  X(25)  VALUE '0000000000000000070900032'.
 42       02 FILLER  PIC  X(25)  VALUE '0000000000000000073700035'.
 43       02 FILLER  PIC  X(25)  VALUE '0000000000000000076600038'.
 44       02 FILLER  PIC  X(25)  VALUE '0000000000000000079800042'.
 45       02 FILLER  PIC  X(25)  VALUE '0000000000000000083700046'.
 46       02 FILLER  PIC  X(25)  VALUE '0000000000000000087900051'.
 47       02 FILLER  PIC  X(25)  VALUE '0000000000000000093000056'.
 48       02 FILLER  PIC  X(25)  VALUE '0000000000000000098100062'.
 49       02 FILLER  PIC  X(25)  VALUE '0000000000000000104100069'.
 50       02 FILLER  PIC  X(25)  VALUE '0000000000000000124500077'.
 51       02 FILLER  PIC  X(25)  VALUE '0000000000000000131800085'.
 52       02 FILLER  PIC  X(25)  VALUE '0000000000000000139000094'.
 53       02 FILLER  PIC  X(25)  VALUE '0000000000000000147100103'.
 54       02 FILLER  PIC  X(25)  VALUE '0000000000000000156300113'.
 55       02 FILLER  PIC  X(25)  VALUE '0000000000000000167700126'.
 56       02 FILLER  PIC  X(25)  VALUE '0000000000000000181100142'.
 57       02 FILLER  PIC  X(25)  VALUE '0000000000000000197100160'.
 58       02 FILLER  PIC  X(25)  VALUE '0000000000000000215000181'.
 59       02 FILLER  PIC  X(25)  VALUE '0000000000000000235500204'.
 60       02 FILLER  PIC  X(25)  VALUE '0000000000000000277400231'.
 61       02 FILLER  PIC  X(25)  VALUE '0000000000000000302700260'.
 62       02 FILLER  PIC  X(25)  VALUE '0000000000000000329100290'.
 63       02 FILLER  PIC  X(25)  VALUE '0000000000000000357900323'.
 64       02 FILLER  PIC  X(25)  VALUE '0000000000000000387600357'.
 65       02 FILLER  PIC  X(25)  VALUE '0000000000000000418300391'.
 66       02 FILLER  PIC  X(25)  VALUE '0000000000000000451800428'.
 67       02 FILLER  PIC  X(25)  VALUE '0000000000000000484400465'.
 68       02 FILLER  PIC  X(25)  VALUE '0000000000000000521200505'.
 69       02 FILLER  PIC  X(25)  VALUE '0000000000000000560200549'.
 70       02 FILLER  PIC  X(25)  VALUE '0000000000000000603300596'.
 71       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 72       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 73       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 74       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 75       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 76       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 77       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 78       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.

      *-------슈퍼재테크          여자 예정이율6.5%---------*
 15       02 FILLER  PIC  X(25)  VALUE '0000000000000000013500005'.
 16       02 FILLER  PIC  X(25)  VALUE '0000000000000000013600005'.
 17       02 FILLER  PIC  X(25)  VALUE '0000000000000000013700006'.
 18       02 FILLER  PIC  X(25)  VALUE '0000000000000000013600005'.
 19       02 FILLER  PIC  X(25)  VALUE '0000000000000000013600005'.
 20       02 FILLER  PIC  X(25)  VALUE '0000000000000000018300005'.
 21       02 FILLER  PIC  X(25)  VALUE '0000000000000000018700006'.
 22       02 FILLER  PIC  X(25)  VALUE '0000000000000000019100006'.
 23       02 FILLER  PIC  X(25)  VALUE '0000000000000000019600007'.
 24       02 FILLER  PIC  X(25)  VALUE '0000000000000000019900007'.
 25       02 FILLER  PIC  X(25)  VALUE '0000000000000000020200008'.
 26       02 FILLER  PIC  X(25)  VALUE '0000000000000000020500008'.
 27       02 FILLER  PIC  X(25)  VALUE '0000000000000000020600008'.
 28       02 FILLER  PIC  X(25)  VALUE '0000000000000000020900008'.
 29       02 FILLER  PIC  X(25)  VALUE '0000000000000000021200009'.
 30       02 FILLER  PIC  X(25)  VALUE '0000000000000000022800009'.
 31       02 FILLER  PIC  X(25)  VALUE '0000000000000000023100009'.
 32       02 FILLER  PIC  X(25)  VALUE '0000000000000000023500010'.
 33       02 FILLER  PIC  X(25)  VALUE '0000000000000000023900010'.
 34       02 FILLER  PIC  X(25)  VALUE '0000000000000000024400011'.
 35       02 FILLER  PIC  X(25)  VALUE '0000000000000000025000011'.
 36       02 FILLER  PIC  X(25)  VALUE '0000000000000000025600012'.
 37       02 FILLER  PIC  X(25)  VALUE '0000000000000000026100013'.
 38       02 FILLER  PIC  X(25)  VALUE '0000000000000000026600013'.
 39       02 FILLER  PIC  X(25)  VALUE '0000000000000000027300014'.
 40       02 FILLER  PIC  X(25)  VALUE '0000000000000000030400015'.
 41       02 FILLER  PIC  X(25)  VALUE '0000000000000000031100016'.
 42       02 FILLER  PIC  X(25)  VALUE '0000000000000000032000017'.
 43       02 FILLER  PIC  X(25)  VALUE '0000000000000000033200018'.
 44       02 FILLER  PIC  X(25)  VALUE '0000000000000000034200020'.
 45       02 FILLER  PIC  X(25)  VALUE '0000000000000000035700021'.
 46       02 FILLER  PIC  X(25)  VALUE '0000000000000000037400023'.
 47       02 FILLER  PIC  X(25)  VALUE '0000000000000000039000025'.
 48       02 FILLER  PIC  X(25)  VALUE '0000000000000000040600027'.
 49       02 FILLER  PIC  X(25)  VALUE '0000000000000000041900029'.
 50       02 FILLER  PIC  X(25)  VALUE '0000000000000000048800031'.
 51       02 FILLER  PIC  X(25)  VALUE '0000000000000000051000034'.
 52       02 FILLER  PIC  X(25)  VALUE '0000000000000000053800037'.
 53       02 FILLER  PIC  X(25)  VALUE '0000000000000000056900041'.
 54       02 FILLER  PIC  X(25)  VALUE '0000000000000000060200045'.
 55       02 FILLER  PIC  X(25)  VALUE '0000000000000000064200049'.
 56       02 FILLER  PIC  X(25)  VALUE '0000000000000000068700055'.
 57       02 FILLER  PIC  X(25)  VALUE '0000000000000000074800060'.
 58       02 FILLER  PIC  X(25)  VALUE '0000000000000000082200069'.
 59       02 FILLER  PIC  X(25)  VALUE '0000000000000000090200078'.
 60       02 FILLER  PIC  X(25)  VALUE '0000000000000000111900087'.
 61       02 FILLER  PIC  X(25)  VALUE '0000000000000000121200098'.
 62       02 FILLER  PIC  X(25)  VALUE '0000000000000000129600108'.
 63       02 FILLER  PIC  X(25)  VALUE '0000000000000000139400119'.
 64       02 FILLER  PIC  X(25)  VALUE '0000000000000000150400132'.
 65       02 FILLER  PIC  X(25)  VALUE '0000000000000000162500145'.
 66       02 FILLER  PIC  X(25)  VALUE '0000000000000000175700161'.
 67       02 FILLER  PIC  X(25)  VALUE '0000000000000000190100178'.
 68       02 FILLER  PIC  X(25)  VALUE '0000000000000000206800196'.
 69       02 FILLER  PIC  X(25)  VALUE '0000000000000000224800217'.
 70       02 FILLER  PIC  X(25)  VALUE '0000000000000000245200240'.
 71       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 72       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 73       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 74       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 75       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 76       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 77       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 78       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.

      *-------슈퍼재테크 2 남자 예정이율6.5%-----*
 15       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000009'.
 16       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000010'.
 17       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000010'.
 18       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000011'.
 19       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000012'.
 20       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000014'.
 21       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000016'.
 22       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000018'.
 23       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000019'.
 24       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000019'.
 25       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000019'.
 26       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000019'.
 27       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000018'.
 28       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000017'.
 29       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000016'.
 30       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000016'.
 31       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000016'.
 32       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000016'.
 33       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000017'.
 34       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000018'.
 35       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000019'.
 36       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000021'.
 37       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000022'.
 38       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000024'.
 39       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000026'.
 40       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000028'.
 41       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000031'.
 42       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000034'.
 43       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000037'.
 44       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000041'.
 45       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000046'.
 46       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000051'.
 47       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000056'.
 48       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000062'.
 49       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000069'.
 50       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000077'.
 51       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000085'.
 52       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000094'.
 53       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000103'.
 54       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000113'.
 55       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000126'.
 56       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000141'.
 57       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000160'.
 58       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000180'.
 59       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000204'.
 60       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000230'.
 61       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000259'.
 62       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000289'.
 63       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000321'.
 64       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000355'.
 65       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000389'.
 66       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000426'.
 67       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000463'.
 68       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000503'.
 69       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000546'.
 70       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000593'.
 71       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000645'.
 72       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000700'.
 73       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000760'.
 74       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000824'.
 75       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000894'.
 76       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000970'.
 77       02 FILLER  PIC  X(25)  VALUE '0000000000000000000001051'.
 78       02 FILLER  PIC  X(25)  VALUE '0000000000000000000001139'.
 79   *   02 FILLER  PIC  X(25)  VALUE '0000000000000000000001234'.
 80   *   02 FILLER  PIC  X(25)  VALUE '0000000000000000000001336'.
 81   *   02 FILLER  PIC  X(25)  VALUE '0000000000000000000001446'.
 82   *   02 FILLER  PIC  X(25)  VALUE '0000000000000000000001564'.
 83   *   02 FILLER  PIC  X(25)  VALUE '0000000000000000000001691'.
 84   *   02 FILLER  PIC  X(25)  VALUE '0000000000000000000001826'.
 85   *   02 FILLER  PIC  X(25)  VALUE '0000000000000000000001971'.

      *------슈퍼재테크 2 여자 예정이율6.5%-----*
 15       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000005'.
 16       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000005'.
 17       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000005'.
 18       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000005'.
 19       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000005'.
 20       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000005'.
 21       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000005'.
 22       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000006'.
 23       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000006'.
 24       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000007'.
 25       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000007'.
 26       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000007'.
 27       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000008'.
 28       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000008'.
 29       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000008'.
 30       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000009'.
 31       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000009'.
 32       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000009'.
 33       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000010'.
 34       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000010'.
 35       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000011'.
 36       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000012'.
 37       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000012'.
 38       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000013'.
 39       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000014'.
 40       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000014'.
 41       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000015'.
 42       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000016'.
 43       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000018'.
 44       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000019'.
 45       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000021'.
 46       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000023'.
 47       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000025'.
 48       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000026'.
 49       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000028'.
 50       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000031'.
 51       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000033'.
 52       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000037'.
 53       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000040'.
 54       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000044'.
 55       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000048'.
 56       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000054'.
 57       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000061'.
 58       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000069'.
 59       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000078'.
 60       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000087'.
 61       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000098'.
 62       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000108'.
 63       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000119'.
 64       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000131'.
 65       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000145'.
 66       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000160'.
 67       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000177'.
 68       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000196'.
 69       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000216'.
 70       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000239'.
 71       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000264'.
 72       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000292'.
 73       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000322'.
 74       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000356'.
 75       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000393'.
 76       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000434'.
 77       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000479'.
 78       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000528'.
 79   *   02 FILLER  PIC  X(25)  VALUE '0000000000000000000000583'.
 80   *   02 FILLER  PIC  X(25)  VALUE '0000000000000000000000643'.
 81   *   02 FILLER  PIC  X(25)  VALUE '0000000000000000000000709'.
 82   *   02 FILLER  PIC  X(25)  VALUE '0000000000000000000000781'.
 83   *   02 FILLER  PIC  X(25)  VALUE '0000000000000000000000861'.
 84   *   02 FILLER  PIC  X(25)  VALUE '0000000000000000000000948'.
 85   *   02 FILLER  PIC  X(25)  VALUE '0000000000000000000001043'.


      *-------직장인 우대설계 남자 예정이율6.5%-----*
 15       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000008'.
 16       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000008'.
 17       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000009'.
 18       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000009'.
 19       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000011'.
 20       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000012'.
 21       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000014'.
 22       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000016'.
 23       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000017'.
 24       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000018'.
 25       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000018'.
 26       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000017'.
 27       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000016'.
 28       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000015'.
 29       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000015'.
 30       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000015'.
 31       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000015'.
 32       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000015'.
 33       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000016'.
 34       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000017'.
 35       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000018'.
 36       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000019'.
 37       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000021'.
 38       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000023'.
 39       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000025'.
 40       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000027'.
 41       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000030'.
 42       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000033'.
 43       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000036'.
 44       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000040'.
 45       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000044'.
 46       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000049'.
 47       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000055'.
 48       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000061'.
 49       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000068'.
 50       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000076'.
 51       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000084'.
 52       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000093'.
 53       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000102'.
 54       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000112'.
 55       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000125'.
 56       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000141'.
 57       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000159'.
 58       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000180'.
 59       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000203'.
 60       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000230'.
 61       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000258'.
 62       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000289'.
 63       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000321'.
 64       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 65       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 66       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 67       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 68       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 69       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 70       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 71       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 72       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 73       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 74       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 75       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 76       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 77       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 78       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.


      *-------직장인 우대설계 여자 예정이율6.5%-----*
 15       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000003'.
 16       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000003'.
 17       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000004'.
 18       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000003'.
 19       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000003'.
 20       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000003'.
 21       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000004'.
 22       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000004'.
 23       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000005'.
 24       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000005'.
 25       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000006'.
 26       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000006'.
 27       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000006'.
 28       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000006'.
 29       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000007'.
 30       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000007'.
 31       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000007'.
 32       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000008'.
 33       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000008'.
 34       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000009'.
 35       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000010'.
 36       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000010'.
 37       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000011'.
 38       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000011'.
 39       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000012'.
 40       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000013'.
 41       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000014'.
 42       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000015'.
 43       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000016'.
 44       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000018'.
 45       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000019'.
 46       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000021'.
 47       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000023'.
 48       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000025'.
 49       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000027'.
 50       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000029'.
 51       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000032'.
 52       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000035'.
 53       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000039'.
 54       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000043'.
 55       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000047'.
 56       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000052'.
 57       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000059'.
 58       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000068'.
 59       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000077'.
 60       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000086'.
 61       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000096'.
 62       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000107'.
 63       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000118'.
 64       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 65       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 66       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 67       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 68       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 69       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 70       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 71       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 72       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 73       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 74       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 75       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 76       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 77       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 78       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.


      *-------거치전환 남자 예정이율6.5%-----*
 15       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000094'.
 16       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000098'.
 17       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000102'.
 18       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000108'.
 19       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000120'.
 20       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000137'.
 21       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000157'.
 22       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000176'.
 23       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000188'.
 24       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000194'.
 25       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000192'.
 26       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000186'.
 27       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000178'.
 28       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000169'.
 29       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000163'.
 30       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000160'.
 31       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000161'.
 32       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000165'.
 33       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000172'.
 34       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000181'.
 35       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000193'.
 36       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000207'.
 37       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000224'.
 38       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000241'.
 39       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000261'.
 40       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000285'.
 41       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000312'.
 42       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000341'.
 43       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000374'.
 44       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000412'.
 45       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000455'.
 46       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000505'.
 47       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000561'.
 48       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000622'.
 49       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000692'.
 50       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000768'.
 51       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000850'.
 52       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000937'.
 53       02 FILLER  PIC  X(25)  VALUE '0000000000000000000001027'.
 54       02 FILLER  PIC  X(25)  VALUE '0000000000000000000001133'.
 55       02 FILLER  PIC  X(25)  VALUE '0000000000000000000001261'.
 56       02 FILLER  PIC  X(25)  VALUE '0000000000000000000001414'.
 57       02 FILLER  PIC  X(25)  VALUE '0000000000000000000001596'.
 58       02 FILLER  PIC  X(25)  VALUE '0000000000000000000001803'.
 59       02 FILLER  PIC  X(25)  VALUE '0000000000000000000002038'.
 60       02 FILLER  PIC  X(25)  VALUE '0000000000000000000002304'.
 61       02 FILLER  PIC  X(25)  VALUE '0000000000000000000002588'.
 62       02 FILLER  PIC  X(25)  VALUE '0000000000000000000002892'.
 63       02 FILLER  PIC  X(25)  VALUE '0000000000000000000003215'.
 64       02 FILLER  PIC  X(25)  VALUE '0000000000000000000003550'.
 65       02 FILLER  PIC  X(25)  VALUE '0000000000000000000003893'.
 66       02 FILLER  PIC  X(25)  VALUE '0000000000000000000004258'.
 67       02 FILLER  PIC  X(25)  VALUE '0000000000000000000004628'.
 68       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 69       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 70       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 71       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 72       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 73       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 74       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 75       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 76       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 77       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 78       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.


      *-------거치전환 여자 예정이율6.5%-----*
 15       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000048'.
 16       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000050'.
 17       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000051'.
 18       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000050'.
 19       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000049'.
 20       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000050'.
 21       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000054'.
 22       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000059'.
 23       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000065'.
 24       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000069'.
 25       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000071'.
 26       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000074'.
 27       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000076'.
 28       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000079'.
 29       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000083'.
 30       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000086'.
 31       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000090'.
 32       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000094'.
 33       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000098'.
 34       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000104'.
 35       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000110'.
 36       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000117'.
 37       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000123'.
 38       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000129'.
 39       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000136'.
 40       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000144'.
 41       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000152'.
 42       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000163'.
 43       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000176'.
 44       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000191'.
 45       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000208'.
 46       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000228'.
 47       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000246'.
 48       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000263'.
 49       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000283'.
 50       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000307'.
 51       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000335'.
 52       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000366'.
 53       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000401'.
 54       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000439'.
 55       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000483'.
 56       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000537'.
 57       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000607'.
 58       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000690'.
 59       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000780'.
 60       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000874'.
 61       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000975'.
 62       02 FILLER  PIC  X(25)  VALUE '0000000000000000000001077'.
 63       02 FILLER  PIC  X(25)  VALUE '0000000000000000000001190'.
 64       02 FILLER  PIC  X(25)  VALUE '0000000000000000000001315'.
 65       02 FILLER  PIC  X(25)  VALUE '0000000000000000000001453'.
 66       02 FILLER  PIC  X(25)  VALUE '0000000000000000000001605'.
 67       02 FILLER  PIC  X(25)  VALUE '0000000000000000000001773'.
 68       02 FILLER  PIC  X(25)  VALUE '0000000000000000000001959'.
 69       02 FILLER  PIC  X(25)  VALUE '0000000000000000000002164'.
 70       02 FILLER  PIC  X(25)  VALUE '0000000000000000000002391'.
 71       02 FILLER  PIC  X(25)  VALUE '0000000000000000000002641'.
 72       02 FILLER  PIC  X(25)  VALUE '0000000000000000000002918'.
 73       02 FILLER  PIC  X(25)  VALUE '0000000000000000000003222'.
 74       02 FILLER  PIC  X(25)  VALUE '0000000000000000000003558'.
 75       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 76       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 77       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.
 78       02 FILLER  PIC  X(25)  VALUE '0000000000000000000000000'.

       01    RISK-NOHOO-RE  REDEFINES   RISK-NOHOO.
          02  RIS-NH        OCCURS    38.
             03  RI-NH      OCCURS    64.
                04  R-NH    OCCURS     5     PIC 9(5).

9807  *----------     END OF FILE    ----------------------------------
