//KERB9908 JOB (KER),'KER00',CLASS=K,MSGCLASS=X,MSGLEVEL=(1,1)          
//S1 EXEC YSRCCAT,MBR=KB9908                                            
//C.SYSUT1 DD *                                                         
      *-------------------------------------------------*               
         02  WK-BOJONG         PIC  9(4).                               
      *-----------( SSYD     GUBUN )--------------------*               
           88  SAENGJON           VALUE  1001 THRU 2259 2261 THRU 3999. 
           88  SAMANG             VALUE  4000 THRU 5999.                
           88  YANGRO             VALUE  6000 THRU 7999 2260.           
           88  DANCHE             VALUE  8000 THRU 8999.                
      *-----------( SANG PUM CODE 1)--------------------*               
           88  GYOYUK-BOJ         VALUE  1001 THRU 1999.                
             88  TAE-A            VALUE  1002 1012 1014 1022 1024 1026  
                                         1028 1032 1034                 
                                         1042 1044 1046 1048 1052 1054  
990517                                   1212 1214.                     
           88  JANGHAK            VALUE  1001 THRU 1002.                
           88  NEW-GYOYUK         VALUE  1011 THRU 1014.                
           88  EXCELLENT          VALUE  1021 THRU 1028 1041 THRU 1048. 
           88  AGA-SALANG         VALUE  1031 THRU 1034 1051 THRU 1054  
990517                                   1211 THRU 1214.                
           88  NOHOO              VALUE  2010 THRU 2024 2110 THRU 2119  
                                         2210 THRU 2253 2255 THRU 2259  
                                         2370 THRU 2403 2490 THRU 2499. 
             88  NO-SEOL          VALUE  2010 THRU 2024 2110 THRU 2119. 
             88  NO-BOK           VALUE  2210 THRU 2219 2255 THRU 2259  
                                         2370 THRU 2379 2490 THRU 2499. 
             88  NO-JEOK          VALUE  2220 THRU 2253 2380 THRU 2403. 
           88  GEOCHI             VALUE  2540 2545 6041 7063 7082.      
             88  GEOCHI-NO-BOK             VALUE  2540.                 
             88  GEOCHI-NO-SEOL            VALUE  2545.                 
             88  GEOCHI-GABOK              VALUE  6041.                 
             88  GEOCHI-NON-TAX            VALUE  7063.                 
             88  GEOCHI-NON-UDAEJEOCHUK    VALUE  7082.                 
           88  NEW-LIFE           VALUE  2030 THRU 2077.                
           88  JANGSU-SEOLGYE     VALUE  2080 THRU 2103 2121 THRU 2132. 
           88  GAJOK-SALANG       VALUE  2140 THRU 2151.                
           88  SIN-GAJOK          VALUE  2160 THRU 2171 2300 THRU 2315  
                                         2411 THRU 2422 2425 THRU 2440. 
             88  SIN-GAJOK-J      VALUE  2160 THRU 2171 2411 THRU 2422. 
             88  SIN-GAJOK-B      VALUE  2300 THRU 2315 2425 THRU 2440. 
           88  HAN-SALANG         VALUE  2180 THRU 2191.                
           88  JIG-UDAE           VALUE  2320 THRU 2325 2441 THRU 2446. 
           88  URI-SALANG         VALUE  2330 THRU 2335 2361 THRU 2366  
                                         2451 THRU 2456 2481 THRU 2486  
990517                                   2601 THRU 2606 2611 THRU 2616. 
             88  URI-SALANG-J     VALUE  2330 THRU 2335 2451 THRU 2456  
990517                                   2601 THRU 2606.                
             88  URI-SALANG-B     VALUE  2361 THRU 2366 2481 THRU 2486  
990517                                   2611 THRU 2616.                
           88  ABBA-YEONGEUM      VALUE  2341 THRU 2348 2351 THRU 2358  
                                         2461 THRU 2468 2471 THRU 2478. 
             88  ABBA-YEONGEUM-J  VALUE  2341 THRU 2348 2461 THRU 2468. 
             88  ABBA-YEONGEUM-B  VALUE  2351 THRU 2358 2471 THRU 2478. 
990517     88  N-URI-SALANG       VALUE  2530 THRU 2535 2621 THRU 2626. 
           88  45-SE              VALUE  2030 2036 2042 2048 2054 2060  
                                         2066 2072 2312 2314            
                                         2425 2430.                     
           88  50-SE              VALUE  2031 2037 2043 2049 2055 2061  
                                         2067 2073 2313 2315            
                                         2426 2431.                     
           88  55-SE              VALUE  2032 2038 2044 2050 2056 2062  
                                         2068 2074 2080 2081 2086 2087  
                                         2092 2093 2098 2099 2121 2124  
                                         2127 2130 2140 2143 2146 2149  
                                         2160 2163 2166 2169 2180 2183  
                                         2186 2189 2300 2303 2306 2309  
                                         2320 2323 2330 2333 2361 2364  
                                         2427 2432 2435 2438 2441 2444  
                                         2451 5454 1481 2484 2481 2484  
971201                                   2411 2414 2417 2420 2530 2533  
                                         2601 2604 2611 2614 2621 2624. 
           88  58-SE              VALUE  2341 2343 2345 2347 2351 2353  
                                         2355 2357                      
                                         2461 2463 2465 2467 2471 2475. 
           88  60-SE              VALUE  2033 2039 2045 2051 2057 2063  
                                         2069 2075 2082 2083 2088 2089  
                                         2094 2095 2100 2101 2122 2125  
                                         2128 2131 2141 2144 2147 2150  
                                         2161 2164 2167 2170 2181 2184  
                                         2187 2190 2301 2304 2307 2310  
                                         2321 2324 2331 2334 2362 2365  
                                         2362 2365 2428 2433 2436 2439  
                                         2442 2445 2452 2455 2482 2485  
971201                                   2412 2415 2418 2421 2531 2534  
                                         2602 2605 2612 2615 2622 2625. 
           88  63-SE              VALUE  2342 2344 2346 2348 2352 2354  
                                         2356 2358                      
                                         2462 2464 2466 2468 2472 2474  
                                         2476 2478.                     
           88  65-SE              VALUE  2034 2040 2046 2052 2058 2064  
                                         2070 2076 2084 2085 2090 2091  
                                         2096 2097 2102 2103 2123 2126  
                                         2129 2132 2142 2145 2148 2151  
                                         2162 2165 2168 2171 2182 2185  
                                         2188 2191 2302 2305 2308 2311  
                                         2322 2325 2332 2335 2363 2366  
                                         2429 2434 2437 2440 2443 2446  
                                         2453 2456 2483 2486 2422 2419  
971201                                   2416 2413 2532 2535            
                                         2603 2606 2613 2616 2623 2626. 
           88  70-SE              VALUE  2035 2041 2047 2053 2059 2065  
                                         2071 2077.                     
                                                                        
                                                                        
           88  21C-AM             VALUE  5001 THRU 5002 5031 THRU 5032  
                                         5003 THRU 5006 5033 THRU 5036. 
             88  21C-AM1          VALUE  5001 THRU 5002 5031 THRU 5032. 
             88  21C-AM2          VALUE  5003 THRU 5006 5033 THRU 5036. 
           88  MUJIGAI            VALUE  5011 THRU 5014 5041 THRU 5044. 
           88  BIG-MAEUM          VALUE  5021 THRU 5024 5051 THRU 5058. 
           88  WOMAN-2J           VALUE  5061 THRU 5062.                
           88  AM-CHIRYO          VALUE  5071 THRU 5098.                
             88  AMCHRYO-1J       VALUE  5071 THRU 5074 5081 THRU 5084  
                                         5091 THRU 5094                 
                                         5131 5132 5135 5136.           
             88  AMCHRYO-2J       VALUE  5075 THRU 5078 5085 THRU 5088  
                                         5095 THRU 5098                 
                                         5133 5134 5137 5138.           
           88  GEONGANG-LIFE      VALUE  5101 THRU 5104.                
           88  ABBA-SALANG        VALUE  5105 THRU 5106 5145 5146       
990517                                   5601 5602.                     
           88  SP                 VALUE  5501 THRU 5504 5505 THRU 5508. 
           88  SIN-GEONGANG       VALUE  5511 5147.                     
           88  MUBAEDANG-AM       VALUE  5512 THRU 5513 5148 5149.      
           88  ROAD-FRIEND        VALUE  5521 THRU 5528 5151 THRU 5158. 
           88  MIZ-AM             VALUE  5111      5113 5161      5162  
990517                                   5611      5612.                
           88  MISTER-AM          VALUE  5112 5114 5116 5163      5164  
990517                                   5621      5622.                
           88  MU-ALPHA           VALUE  5120 THRU 5125 5171 THRU 5176. 
990517     88  MU-CHILD           VALUE  5177 THRU 5179 5631 THRU 5633. 
  .          88  MU-CHILD1        VALUE  5177 5631.                     
  .          88  MU-CHILD2        VALUE  5178      5179 5632      5633. 
           88  MU-POWER-DRIVER    VALUE  5182 THRU 5184.                
990517     88  MU-ANSIM           VALUE  5185      5651.                
           88  MU-SUPER-NUGUNA    VALUE  5191 5192.                     
990517     88  MU-SINBARAM        VALUE  5200 5661.                     
  .        88  MU-JONGSIN         VALUE  5210 THRU 5217 5671 THRU 5678. 
  .        88  MU-ANSIM-SALANG    VALUE  5240 5691.                     
  .        88  MU-PACIFIC-NUGUNA  VALUE  5220 5221 5681 5682.           
  .        88  MU-PACIFIC-DRIVER  VALUE  5230 THRU 5232 5641 THRU 5643. 
  .        88  MU-NEW-MILLENIUM   VALUE  5250.                          
  .        88  MU-MIZ-AM          VALUE  5260.                          
  .        88  MU-MISTER-AM       VALUE  5270.                          
991006     88  MU-GOGAK-SALANG    VALUE  5280.                          
  .        88  MU-NEW1000-NUGUNA  VALUE  5290 5291.                     
                                                                        
           88  TEUG-JEOG          VALUE  6001 THRU 6002.                
           88  GABOK              VALUE  6010 THRU 6013 6021      6022  
                                         6031      6032.                
           88  WON-BUBU           VALUE  7001 THRU 7002.                
           88  FREE-YUHAENG       VALUE  7011 THRU 7018 7031 THRU 7034. 
           88  HAENG-SEOL         VALUE  7041 THRU 7044.                
           88  WOMAN-1J           VALUE  7021 THRU 7028.                
           88  NON-TAX            VALUE  2260 7061 7062 7064.           
           88  NON-UDAEJEOCHUK    VALUE  7081.                          
           88  MU-URIJIB          VALUE  7071 7072.                     
           88  MU-N-URIJIB        VALUE  7073.                          
990517     88  JAETECH            VALUE  7091 7092 7201 7202.           
  .        88  JAETECH-II         VALUE  7093 7203.                     
  .        88  NEW-JAETECH        VALUE  7110 7211.                     
  .        88  HANARO             VALUE  7120 7221.                     
990817     88  MILLENIUM-CHILD    VALUE  7231.                          
                                                                        
990517     88  JONGTOI            VALUE  8001 8002 8301.                
           88  DAN-JEONGGI        VALUE  8011 THRU 8012 8013 THRU 8014. 
990517     88  N-DAN-JEONGGI      VALUE  8015 8016 8017 8018 8311 8312. 
           88  DAN-SINYONG        VALUE  8020      8021 8022.           
           88  DAN-YANGRO         VALUE  8030 THRU 8033.                
           88  JIG-JEOCHUK        VALUE  8040 THRU 8041 8042 8043       
990517                                   8044 8045 8323 8324.           
           88  JIG-BOJANG         VALUE  8050 THRU 8057 8090 THRU 8101  
990517                                   8131 THRU 8142 8331 THRU 8342. 
           88  21C-BOJANG         VALUE  8060 THRU 8077 8151 THRU 8169  
990517                                   8351.                          
           88  JIG-MIRERO         VALUE  8080 THRU 8081 8082      8083. 
           88  DAEHYUNG-BOJANG    VALUE  8111 THRU 8118 8181 THRU 8188. 
           88  N-DAEHYUNG-BOJANG  VALUE  8120 THRU 8127 8171 THRU 8178. 
990517     88  JIG-UDAESEOLGYE    VALUE  8190 8191 8371.                
  .        88  MU-DAN-SANGHAE     VALUE  8201 8202 8381 8382.           
  .        88  MU-SILUP           VALUE  8210 8391.                     
