//KERC7107 JOB (KER),'KER01',CLASS=G,MSGCLASS=X,MSGLEVEL=(1,1)          
//STEP1 EXEC YCOBBAT,MBR=K00C7107                                       
//COB.SYSIN DD *                                                        
PROCESS TEST(STMT,SYM)                                                  
      *=================================*                               
       IDENTIFICATION          DIVISION.                                
       PROGRAM-ID.             K00C7107.                                
       ENVIRONMENT             DIVISION.                                
       CONFIGURATION           SECTION.                                 
       INPUT-OUTPUT            SECTION.                                 
       FILE-CONTROL.                                                    
           SELECT  FILE-IN1    ASSIGN  TO  FILEIN1.                     
           SELECT  FILE-IN2    ASSIGN  TO  FILEIN2.                     
           SELECT  FILE-OUT   ASSIGN  TO   FILEOUT.                     
       DATA                    DIVISION.                                
       FILE                    SECTION.                                 
       FD  FILE-IN1          RECORDING  MODE     IS   F                 
                             LABEL   RECORD      IS   STANDARD          
                             BLOCK   CONTAINS    50   RECORDS           
                             RECORD  CONTAINS   283   CHARACTERS.       
       01  REC-K4.   COPY   K00B9018.                                   
                                                                        
       FD  FILE-IN2          RECORDING  MODE     IS   F                 
                             LABEL   RECORD      IS   STANDARD          
                             BLOCK   CONTAINS   100   RECORDS           
                             RECORD  CONTAINS   124   CHARACTERS.       
       01  REC-K3.   COPY   K00B9017.                                   
                                                                        
       FD  FILE-OUT          RECORDING  MODE     IS   F                 
                             LABEL   RECORD      IS   STANDARD          
                             BLOCK   CONTAINS    50   RECORDS           
                             RECORD  CONTAINS   283   CHARACTERS.       
       01  REC-OUT               PIC X(283).                            
      *-------------------------------*                                 
       WORKING-STORAGE         SECTION.                                 
      *-------------------------------*                                 
       01  REC-9028.    COPY   K00B9028.                                
       01  K4-KEY.                                                      
           02  WK4-JEUNGBEON        PIC 9(7).                           
           02  WK4-BOJONG-T         PIC 9(4).                           
       01  K3-KEY.                                                      
           02  WK3-JEUNGBEON        PIC 9(7).                           
           02  WK3-BOJONG-T         PIC 9(4).                           
       01  WORK-SPACE.                                                  
         02 WK-JNGBEON              PIC 9(7).                           
             88  S-JNGBEON  VALUE                                       
     ***----------미지급소멸건---------------------------------------*
                 0732929  0728816  0732929  0969386                     
                 1135179  1267731  1873945 5072056                      
                 0892385  1051451  0879310  1135179  1150095            
                 1839894  1851379  1854154  1887069  1435484            
                 1774160  1498773  1498774  0004637  0267071            
                 0372974  0735311  0755506  0443195  0506430            
                 0813467  0570131  1824757  1837676  1843421            
                 1840715  1855411  1857189  1672258  1527787            
                 1451800  1458390  1528361  1222549  1248869            
                 1190201  1840495  1839892  1841599  1305303            
                 1846380  1872621  2026278  1515485  1508427            
                 1483543  1463165  1546973  1548001  1530196            
                 1526495  1589922  1597795  1601956  1605619            
                 1668879  1605707  1821716  1698360  1691865            
                 1682266  1759290  1744319  1728490  1739860            
                 1852350  1850554  1850555  1850975  1852349            
                 1854742  1855410  1840241  1846714  1880357            
                 1880358  1880359  1877226  1879579  1830603            
                 1834146  1834147  1829464  1911113  1911572            
                 1888758  1892760  1893813  1842847  1859105            
                 1859772  1860023  1878827  1886873  1881227            
                 1863756  1860082  1861458  1863285  1873430            
                 1875726  1876004  1895047  1895457  1889281            
                 1913110  1913161  2028003  2023040  2024515            
                 2010767  2029081  2026761  2026034  1927840            
                 1911831  1873431  1869998  1885426  1876943            
                 1890301  1945435  2010719  1943688  2010768            
                 2025539  2023948  2021959  2026035  2026546            
                 2025541  2025803  2026033  2026549  2026557            
                 2026762  1915553  1915686  1929665  1929666            
                 1930143  1940223  2029289  2029753  2030023            
                 0699937  1039357  1191709  1393518  1360014            
                 1527852  1541177  1799564  1881231  2029754            
                 1930603  1942130  1928457  1913563  1912938            
                 1912397  1912739  1910897  2029220  2026602            
                 2026032  2025540  2025538  2010902  1942184            
                 1941838                                                
     ***----------조사중소멸건---------------------------------------*
                 1177651  1466372  1237179  1437931  1540211            
                 1740502  1784544  1740501  2033001  1915641            
                 2023981  1395597  1541177  1685098  1541196            
                 1723761  2011371.                                      
                                                                        
         02  WK-BOJONG              PIC 9(4).                           
           88  MUBAE-BOJ   VALUE   5501 THRU 5504  5511 THRU 5513       
                                   5120 THRU 5125  7071 THRU 7072       
                                   5147 THRU 5149  5505 THRU 5508       
                                   5171 THRU 5179  5182 THRU 5185       
                                   5191      5192  5200                 
                                   5210 THRU 5217  5220      5221       
                                   5230 THRU 5232  5240                 
                                   7073                                 
                                                                        
9906                               5631 THRU 5633  5651 5661            
  .                                5671 THRU 5678  5641 THRU 5643       
  .                                5691 5681 5682  5250 5260 5270       
991006                             5280 5290 5291.                      
         02  BOJONG-T               PIC 9(4).                           
             88  JNG-BOJ       VALUE 6001      9001.                    
         02  I                      PIC 9(2).                           
         02  WK-YEJ-IYUL            PIC S9(5)    COMP-3.                
         02  TOT                    PIC S9(10).                         
         02  CNT-IN1                PIC 9(7).                           
         02  CNT-IN2                PIC 9(7).                           
         02  CNT-OUT                PIC 9(7).                           
         02  CNT-OUT2               PIC 9(7).                           
         02  CNT-ERR-IN             PIC 9(7).                           
         02  CNT-MATCH              PIC 9(7).                           
       01  REC-SWITCH.                                                  
           02  FILE-EOF-SWITCH-1       PIC X(3)  VALUE  'NO '.          
               88  FILE-EOF-1                    VALUE  'YES'.          
           02  FILE-EOF-SWITCH-2       PIC X(3)  VALUE  'NO '.          
               88  FILE-EOF-2                    VALUE  'YES'.          
       EJECT                                                            
      *=================================*                               
       PROCEDURE               DIVISION.                                
      *=================================*                               
      *---------*                                                       
       000-BODY.                                                        
      *---------*                                                       
           OPEN            INPUT         FILE-IN1     FILE-IN2          
                           OUTPUT        FILE-OUT.                      
           MOVE  ZERO  TO  WORK-SPACE.                                  
           PERFORM         110-READ-FILEIN-1.                           
           PERFORM         120-READ-FILEIN-2.                           
           PERFORM         100-PG-CONTROL       UNTIL  (FILE-EOF-1      
                                                OR      FILE-EOF-2).    
           PERFORM         200-PG-CONTROL       UNTIL   FILE-EOF-1.     
           PERFORM         300-PG-CONTROL       UNTIL   FILE-EOF-2.     
           DISPLAY    '*===========================================*'.  
           DISPLAY    '      CNT-IN1   TOTAL  =  '  CNT-IN1.            
           DISPLAY    '      CNT-IN2   TOTAL  =  '  CNT-IN2.            
           DISPLAY    '      CNT-MATCH TOTAL  =  '  CNT-MATCH.          
           DISPLAY    '      CNT-ERR          =  '  CNT-ERR-IN.         
           DISPLAY    '      CNT-OUT   TOTAL  =  '  CNT-OUT.            
           DISPLAY    '*===========================================*'.  
           CLOSE           FILE-IN1   FILE-IN2  FILE-OUT.               
           STOP RUN.                                                    
       EJECT                                                            
      *---------------*                                                 
       100-PG-CONTROL.                                                  
      *---------------*                                                 
           IF  K4-KEY  =  K3-KEY                                        
                        PERFORM          130-MATCH-CHEORI               
                        PERFORM          101-MOVE-WRITE                 
                        PERFORM          110-READ-FILEIN-1              
                        PERFORM          120-READ-FILEIN-2              
           ELSE                                                         
           IF  K4-KEY   >  K3-KEY                                       
                        PERFORM          140-I2-ERR-CHEORI              
                        PERFORM          120-READ-FILEIN-2              
           ELSE                                                         
                        PERFORM          101-MOVE-WRITE                 
                        PERFORM          110-READ-FILEIN-1.             
      *---------------*                                                 
       200-PG-CONTROL.                                                  
      *---------------*                                                 
           PERFORM          101-MOVE-WRITE.                             
           PERFORM          110-READ-FILEIN-1.                          
      *---------------*                                                 
       300-PG-CONTROL.                                                  
      *---------------*                                                 
           PERFORM          140-I2-ERR-CHEORI.                          
           PERFORM          120-READ-FILEIN-2.                          
      *------------------*                                              
       110-READ-FILEIN-1.                                               
      *------------------*                                              
           READ    FILE-IN1  END   MOVE  'YES'  TO  FILE-EOF-SWITCH-1.  
           IF  NOT FILE-EOF-1    ADD     1           TO  CNT-IN1        
                                 MOVE  K4-JEUNGBEON  TO  WK4-JEUNGBEON  
                                 MOVE  K4-BOJONG-T   TO  WK4-BOJONG-T.  
      *-----------------*                                               
       120-READ-FILEIN-2.                                               
      *-----------------*                                               
           READ  FILE-IN2    END   MOVE  'YES'  TO  FILE-EOF-SWITCH-2.  
           IF  NOT  FILE-EOF-2   ADD     1           TO  CNT-IN2        
                                 MOVE  K3-JEUNGBEON  TO  WK3-JEUNGBEON  
                                 MOVE  K3-BOJONG-T   TO  WK3-BOJONG-T.  
      *----------------*                                                
       130-MATCH-CHEORI.                                                
      *----------------*                                                
           IF   K3-BOJONG-T  =  9510  OR  9621                          
                   MOVE   K3-NABIB-HOISU        TO   K4-LNAB-HOISU.     
           ADD    K3-PURE-YY                    TO   K4-PURE-YY.        
           ADD    K3-PURE-MM    K3-SEON-IJA     TO   K4-PURE-MM.        
           ADD    K3-HAIYAG-YY                  TO   K4-HAIYAG-YY.      
           ADD    K3-HAIYAG-MM  K3-SEON-IJA     TO   K4-HAIYAG-MM.      
           MOVE   K3-IYUL                       TO   K4-IYUL.           
           COMPUTE   TOT  =   K4-HAIYAG-YY  +  K4-HAIYAG-MM.            
           IF  TOT  <  ZERO                                             
                  MOVE  ZERO   TO    K4-HAIYAG-YY   K4-HAIYAG-MM.       
           MOVE  K4-JEUNGBEON  TO  WK-JNGBEON.                          
           IF  S-JNGBEON                                                
             IF   K4-BSMG NOT = 4                                       
                      MOVE  ZERO          TO  K4-PURE-YY                
                      K4-PURE-MM K4-HAIYAG-YY K4-HAIYAG-MM              
                      K4-MI-SEON-GEUM     K4-PB K4-SEON-HOISU           
             ELSE  IF K4-JT < 2                                         
                      DISPLAY ' JOSA NEEDS ! ' K4-JEUNGBEON             
                                      ' BSMG ' K4-BSMG.                 
           ADD    1    TO      CNT-MATCH.                               
      *----------------*                                                
       150-IJA-COMPUTE.                                                 
      *----------------*                                                
           MOVE      K4-BOJONG         TO      WK-BOJONG.               
           MOVE      K4-JEUNGBEON      TO      KI-JEUNGBEON.            
           MOVE      K4-BOJONG         TO      KI-BOJONG.               
           MOVE      K4-BSMG           TO      KI-BSMG.                 
           MOVE      K4-GYE-YMD        TO      KI-GYE-YMD.              
           MOVE      K4-NABGI          TO      KI-NABGI.                
           MOVE      K4-MANGI          TO      KI-MANGI.                
           MOVE      K4-NABBANG        TO      KI-NABBANG.              
           MOVE      K4-LNAB-YM        TO      KI-LNAB-YM.              
           MOVE      K4-BOGEUM         TO      KI-BOGEUM.               
           MOVE      K4-BOLYO          TO      KI-BOLYO.                
           MOVE      K4-JIGB-YMD       TO      KI-JIGB-YMD.             
           IF  K4-BSMG = 7 OR 8      MOVE   7   TO  K4-BSMG.            
           COMPUTE KI-JUNBI-GM ROUNDED =   K4-HAIYAG-YY  + K4-HAIYAG-MM.
           IF  NOT (K4-VT(2)= ZERO  AND K4-VT1(2) = ZERO)               
              IF  K4-IYUL = ZERO   DISPLAY 'BOJ = ' K4-BOJONG-T.        
9906       IF  MUBAE-BOJ                                                
  .          IF  K4-GYE-YM  >  199903    MOVE  750  TO  WK-YEJ-IYUL     
  .          ELSE                                                       
  .            IF     K4-MANGI < 11        MOVE  950  TO  WK-YEJ-IYUL   
  .            ELSE                        MOVE  850  TO  WK-YEJ-IYUL   
           ELSE                                                         
             IF  K4-GYE-YM  >  199903      MOVE  650  TO  WK-YEJ-IYUL   
             ELSE                          MOVE  750  TO  WK-YEJ-IYUL.  
           DIVIDE  WK-YEJ-IYUL  BY  10000    GIVING  KI-IYUL.           
           CALL    'K11M8023'   USING    REC-9028.                      
           IF   KI-CODE   NOT = ZERO                                    
                  DISPLAY  'ERR-SUB = ' KI-CODE ' JNG = ' K4-JEUNGBEON  
                           ' NB = '  K4-NABBANG  ' BOJ = ' K4-BOJONG.   
           MOVE    KI-IJA               TO     K4-IJA.                  
      *--------------*                                                  
       101-MOVE-WRITE.                                                  
      *--------------*                                                  
           MOVE    ZERO      TO     K4-IJA.                             
           IF  (K4-BSMG = 3 OR 7 OR 8)  PERFORM  150-IJA-COMPUTE.       
                                                                        
           WRITE      REC-OUT       FROM    REC-K4.                     
           ADD           1          TO      CNT-OUT.                    
      *-----------------*                                               
       140-I2-ERR-CHEORI.                                               
      *-----------------*                                               
           ADD    1    TO      CNT-ERR-IN.                              
           DISPLAY   ' ERROR  KEY  ==>  '  K3-KEY ' ' K4-KEY.           
